
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
#include "BasicType.h"
#include "CoreUObject.h"
#include "merged_AudioMixer_Engine_UMG_MovieScene_MovieSceneTracks.h"
#include "InteractiveToolsFramework.h"
#include "ModelingComponents.h"
#include "ModelingOperators.h"

#pragma pack(push, 0x1)

class UAcceptOutputProperties;
class UAddArrowPrimitiveTool;
class UAddBoxPrimitiveTool;
class UAddConePrimitiveTool;
class UAddCylinderPrimitiveTool;
class UAddDiscPrimitiveTool;
class UAddPatchTool;
class UAddPatchToolBuilder;
class UAddPatchToolProperties;
class UAddPrimitiveTool;
class UAddPrimitiveToolBuilder;
class UAddPuncturedDiscPrimitiveTool;
class UAddRectanglePrimitiveTool;
class UAddRoundedRectanglePrimitiveTool;
class UAddSpherePrimitiveTool;
class UAddSphericalBoxPrimitiveTool;
class UAddTorusPrimitiveTool;
class UAlignObjectsTool;
class UAlignObjectsToolBuilder;
class UAlignObjectsToolProperties;
class UBakeMeshAttributeMapsTool;
class UBakeMeshAttributeMapsToolBuilder;
class UBakeMeshAttributeMapsToolProperties;
class UBakeTransformTool;
class UBakeTransformToolBuilder;
class UBakeTransformToolProperties;
class UBakedCurvatureMapToolProperties;

class UPositionPlaneOnSceneInputBehavior;
class UProceduralArrowToolProperties;
class UProceduralBoxToolProperties;
class UProceduralConeToolProperties;
class UProceduralCylinderToolProperties;
class UProceduralDiscToolProperties;
class UProceduralPuncturedDiscToolProperties;
class UProceduralRectangleToolProperties;
class UProceduralRoundedRectangleToolProperties;
class UProceduralShapeToolProperties;
class UProceduralSphereToolProperties;
class UProceduralSphericalBoxToolProperties;
class UProceduralTorusToolProperties;
class UProjectToTargetTool;
class UProjectToTargetToolBuilder;
class UProjectToTargetToolProperties;
class UPullKelvinletBrushOpProps;
class URemeshMeshTool;
class URemeshMeshToolBuilder;
class URemeshMeshToolProperties;
class URemeshProperties;
class URemoveOccludedTrianglesAdvancedProperties;
class URemoveOccludedTrianglesOperatorFactory;
class URemoveOccludedTrianglesTool;
class URemoveOccludedTrianglesToolBuilder;
class URemoveOccludedTrianglesToolProperties;
class URevolveBoundaryOperatorFactory;
class URevolveBoundaryTool;
class URevolveBoundaryToolBuilder;
class URevolveBoundaryToolProperties;
class URevolveOperatorFactory;
class URevolveProperties;
class URevolveToolProperties;
class UScaleKelvinletBrushOpProps;
class USculptBrushProperties;
class USculptMaxBrushOpProps;
class USculptMaxBrushProperties;
class USeamSculptTool;
class USeamSculptToolBuilder;
class USeamSculptToolProperties;
class USecondarySmoothBrushOpProps;
class USelfUnionMeshesTool;
class USelfUnionMeshesToolBuilder;
class USelfUnionMeshesToolProperties;
class USetCollisionGeometryTool;
class USetCollisionGeometryToolBuilder;
class USetCollisionGeometryToolProperties;
class USharpPullKelvinletBrushOpProps;
class USmoothBrushOpProps;
class USmoothFillBrushOpProps;
class USmoothHoleFillProperties;
class USmoothMeshTool;
class USmoothMeshToolBuilder;
class USmoothMeshToolProperties;
class USmoothWeightMapSetProperties;
class USpaceDeformerOperatorFactory;
class UStandardSculptBrushOpProps;
class UTransformMeshesTool;
class UTransformMeshesToolBuilder;
class UTransformMeshesToolProperties;
class UTwistKelvinletBrushOpProps;
class UUVProjectionAdvancedProperties;
class UUVProjectionOperatorFactory;
class UUVProjectionTool;
class UUVProjectionToolBuilder;
class UUVProjectionToolProperties;
class UVertexBrushSculptProperties;
class UViewAlignedPlaneBrushOpProps;
class UViewAlignedSculptBrushOpProps;
class UVoxelBlendMeshesTool;
class UVoxelBlendMeshesToolBuilder;
class UVoxelBlendMeshesToolProperties;
class UVoxelMorphologyMeshesTool;
class UVoxelMorphologyMeshesToolBuilder;
class UVoxelMorphologyMeshesToolProperties;
class UVoxelSolidifyMeshesTool;
class UVoxelSolidifyMeshesToolBuilder;
class UVoxelSolidifyMeshesToolProperties;
class UWeldMeshEdgesTool;
class UWeldMeshEdgesToolBuilder;
class UWorkPlaneProperties;

/// Enum /Script/MeshModelingTools.EMakeMeshPolygroupMode
/// Size: 0x01 (1 bytes)
enum class EMakeMeshPolygroupMode : uint8_t
{
	EMakeMeshPolygroupMode__Single                                                   = 0,
	EMakeMeshPolygroupMode__PerFace                                                  = 1,
	EMakeMeshPolygroupMode__PerQuad                                                  = 2
};

/// Enum /Script/MeshModelingTools.EMakeMeshPivotLocation
/// Size: 0x01 (1 bytes)
enum class EMakeMeshPivotLocation : uint8_t
{
	EMakeMeshPivotLocation__Base                                                     = 0,
	EMakeMeshPivotLocation__Centered                                                 = 1,
	EMakeMeshPivotLocation__Top                                                      = 2
};

/// Enum /Script/MeshModelingTools.EMakeMeshPlacementType
/// Size: 0x01 (1 bytes)
enum class EMakeMeshPlacementType : uint8_t
{
	EMakeMeshPlacementType__GroundPlane                                              = 0,
	EMakeMeshPlacementType__OnScene                                                  = 1
};

/// Enum /Script/MeshModelingTools.EAlignObjectsBoxPoint
/// Size: 0x04 (4 bytes)
enum class EAlignObjectsBoxPoint : uint32_t
{
	EAlignObjectsBoxPoint__Center                                                    = 0,
	EAlignObjectsBoxPoint__Bottom                                                    = 1,
	EAlignObjectsBoxPoint__Top                                                       = 2,
	EAlignObjectsBoxPoint__Left                                                      = 3,
	EAlignObjectsBoxPoint__Right                                                     = 4,
	EAlignObjectsBoxPoint__Front                                                     = 5,
	EAlignObjectsBoxPoint__Back                                                      = 6,
	EAlignObjectsBoxPoint__Min                                                       = 7,
	EAlignObjectsBoxPoint__Max                                                       = 8
};

/// Enum /Script/MeshModelingTools.EAlignObjectsAlignToOptions
/// Size: 0x04 (4 bytes)
enum class EAlignObjectsAlignToOptions : uint32_t
{
	EAlignObjectsAlignToOptions__FirstSelected                                       = 0,
	EAlignObjectsAlignToOptions__LastSelected                                        = 1,
	EAlignObjectsAlignToOptions__Combined                                            = 2
};

/// Enum /Script/MeshModelingTools.EAlignObjectsAlignTypes
/// Size: 0x04 (4 bytes)
enum class EAlignObjectsAlignTypes : uint32_t
{
	EAlignObjectsAlignTypes__Pivots                                                  = 0,
	EAlignObjectsAlignTypes__BoundingBoxes                                           = 1
};

/// Enum /Script/MeshModelingTools.EBakedCurvatureClampMode
/// Size: 0x04 (4 bytes)
enum class EBakedCurvatureClampMode : uint32_t
{
	EBakedCurvatureClampMode__None                                                   = 0,
	EBakedCurvatureClampMode__Positive                                               = 1,
	EBakedCurvatureClampMode__Negative                                               = 2
};

/// Enum /Script/MeshModelingTools.EBakedCurvatureColorMode
/// Size: 0x04 (4 bytes)
enum class EBakedCurvatureColorMode : uint32_t
{
	EBakedCurvatureColorMode__Grayscale                                              = 0,
	EBakedCurvatureColorMode__RedBlue                                                = 1,
	EBakedCurvatureColorMode__RedGreenBlue                                           = 2
};

/// Enum /Script/MeshModelingTools.EBakedCurvatureTypeMode
/// Size: 0x04 (4 bytes)
enum class EBakedCurvatureTypeMode : uint32_t
{
	EBakedCurvatureTypeMode__MeanAverage                                             = 0,
	EBakedCurvatureTypeMode__Max                                                     = 1,
	EBakedCurvatureTypeMode__Min                                                     = 2,
	EBakedCurvatureTypeMode__Gaussian                                                = 3
};

/// Enum /Script/MeshModelingTools.EOcclusionMapPreview
/// Size: 0x04 (4 bytes)
enum class EOcclusionMapPreview : uint32_t
{
	EOcclusionMapPreview__AmbientOcclusion                                           = 0,
	EOcclusionMapPreview__BentNormal                                                 = 1
};

/// Enum /Script/MeshModelingTools.EOcclusionMapDistribution
/// Size: 0x04 (4 bytes)
enum class EOcclusionMapDistribution : uint32_t
{
	EOcclusionMapDistribution__Uniform                                               = 0,
	EOcclusionMapDistribution__Cosine                                                = 1
};

/// Enum /Script/MeshModelingTools.ENormalMapSpace
/// Size: 0x04 (4 bytes)
enum class ENormalMapSpace : uint32_t
{
	ENormalMapSpace__Tangent                                                         = 0,
	ENormalMapSpace__Object                                                          = 1
};

/// Enum /Script/MeshModelingTools.EBakeTextureResolution
/// Size: 0x04 (4 bytes)
enum class EBakeTextureResolution : uint32_t
{
	EBakeTextureResolution__Resolution16                                             = 16,
	EBakeTextureResolution__Resolution32                                             = 32,
	EBakeTextureResolution__Resolution64                                             = 64,
	EBakeTextureResolution__Resolution128                                            = 128,
	EBakeTextureResolution__Resolution256                                            = 256,
	EBakeTextureResolution__Resolution512                                            = 512,
	EBakeTextureResolution__Resolution1024                                           = 1024,
	EBakeTextureResolution__Resolution2048                                           = 2048,
	EBakeTextureResolution__Resolution4096                                           = 4096,
	EBakeTextureResolution__Resolution8192                                           = 8192
};

/// Enum /Script/MeshModelingTools.EBakeMapType
/// Size: 0x04 (4 bytes)
enum class EBakeMapType : uint32_t
{
	EBakeMapType__TangentSpaceNormalMap                                              = 0,
	EBakeMapType__Occlusion                                                          = 1,
	EBakeMapType__Curvature                                                          = 2,
	EBakeMapType__Texture2DImage                                                     = 3,
	EBakeMapType__NormalImage                                                        = 4,
	EBakeMapType__FaceNormalImage                                                    = 5,
	EBakeMapType__PositionImage                                                      = 6
};

/// Enum /Script/MeshModelingTools.EBakeScaleMethod
/// Size: 0x01 (1 bytes)
enum class EBakeScaleMethod : uint8_t
{
	EBakeScaleMethod__BakeFullScale                                                  = 0,
	EBakeScaleMethod__BakeNonuniformScale                                            = 1,
	EBakeScaleMethod__DoNotBakeScale                                                 = 2
};

/// Enum /Script/MeshModelingTools.ECollisionGeometryMode
/// Size: 0x04 (4 bytes)
enum class ECollisionGeometryMode : uint32_t
{
	ECollisionGeometryMode__Default                                                  = 0,
	ECollisionGeometryMode__SimpleAndComplex                                         = 1,
	ECollisionGeometryMode__UseSimpleAsComplex                                       = 2,
	ECollisionGeometryMode__UseComplexAsSimple                                       = 3
};

/// Enum /Script/MeshModelingTools.ECombineTargetType
/// Size: 0x04 (4 bytes)
enum class ECombineTargetType : uint32_t
{
	ECombineTargetType__NewAsset                                                     = 0,
	ECombineTargetType__FirstInputAsset                                              = 1,
	ECombineTargetType__LastInputAsset                                               = 2
};

/// Enum /Script/MeshModelingTools.EConvertToPolygonsMode
/// Size: 0x04 (4 bytes)
enum class EConvertToPolygonsMode : uint32_t
{
	EConvertToPolygonsMode__FaceNormalDeviation                                      = 0,
	EConvertToPolygonsMode__FromUVISlands                                            = 1
};

/// Enum /Script/MeshModelingTools.EQuickTransformerMode
/// Size: 0x01 (1 bytes)
enum class EQuickTransformerMode : uint8_t
{
	EQuickTransformerMode__AxisTranslation                                           = 0,
	EQuickTransformerMode__AxisRotation                                              = 1
};

/// Enum /Script/MeshModelingTools.EWeightScheme
/// Size: 0x04 (4 bytes)
enum class EWeightScheme : uint32_t
{
	EWeightScheme__Uniform                                                           = 0,
	EWeightScheme__Umbrella                                                          = 1,
	EWeightScheme__Valence                                                           = 2,
	EWeightScheme__MeanValue                                                         = 3,
	EWeightScheme__Cotangent                                                         = 4,
	EWeightScheme__ClampedCotangent                                                  = 5
};

/// Enum /Script/MeshModelingTools.EGroupTopologyDeformationStrategy
/// Size: 0x01 (1 bytes)
enum class EGroupTopologyDeformationStrategy : uint8_t
{
	EGroupTopologyDeformationStrategy__Linear                                        = 0,
	EGroupTopologyDeformationStrategy__Laplacian                                     = 1
};

/// Enum /Script/MeshModelingTools.EDisplaceMeshToolDisplaceType
/// Size: 0x01 (1 bytes)
enum class EDisplaceMeshToolDisplaceType : uint8_t
{
	EDisplaceMeshToolDisplaceType__Constant                                          = 0,
	EDisplaceMeshToolDisplaceType__RandomNoise                                       = 1,
	EDisplaceMeshToolDisplaceType__PerlinNoise                                       = 2,
	EDisplaceMeshToolDisplaceType__DisplacementMap                                   = 3,
	EDisplaceMeshToolDisplaceType__SineWave                                          = 4
};

/// Enum /Script/MeshModelingTools.EDrawPolygonOutputMode
/// Size: 0x01 (1 bytes)
enum class EDrawPolygonOutputMode : uint8_t
{
	EDrawPolygonOutputMode__MeshedPolygon                                            = 0,
	EDrawPolygonOutputMode__ExtrudedConstant                                         = 1,
	EDrawPolygonOutputMode__ExtrudedInteractive                                      = 2
};

/// Enum /Script/MeshModelingTools.EDrawPolygonDrawMode
/// Size: 0x01 (1 bytes)
enum class EDrawPolygonDrawMode : uint8_t
{
	EDrawPolygonDrawMode__Freehand                                                   = 0,
	EDrawPolygonDrawMode__Circle                                                     = 1,
	EDrawPolygonDrawMode__Square                                                     = 2,
	EDrawPolygonDrawMode__Rectangle                                                  = 3,
	EDrawPolygonDrawMode__RoundedRectangle                                           = 4,
	EDrawPolygonDrawMode__HoleyCircle                                                = 5
};

/// Enum /Script/MeshModelingTools.EDrawPolyPathExtrudeDirection
/// Size: 0x04 (4 bytes)
enum class EDrawPolyPathExtrudeDirection : uint32_t
{
	EDrawPolyPathExtrudeDirection__SelectionNormal                                   = 0,
	EDrawPolyPathExtrudeDirection__WorldX                                            = 1,
	EDrawPolyPathExtrudeDirection__WorldY                                            = 2,
	EDrawPolyPathExtrudeDirection__WorldZ                                            = 3,
	EDrawPolyPathExtrudeDirection__LocalX                                            = 4,
	EDrawPolyPathExtrudeDirection__LocalY                                            = 5,
	EDrawPolyPathExtrudeDirection__LocalZ                                            = 6
};

/// Enum /Script/MeshModelingTools.EDrawPolyPathHeightMode
/// Size: 0x04 (4 bytes)
enum class EDrawPolyPathHeightMode : uint32_t
{
	EDrawPolyPathHeightMode__Interactive                                             = 0,
	EDrawPolyPathHeightMode__Constant                                                = 1
};

/// Enum /Script/MeshModelingTools.EDrawPolyPathWidthMode
/// Size: 0x04 (4 bytes)
enum class EDrawPolyPathWidthMode : uint32_t
{
	EDrawPolyPathWidthMode__Interactive                                              = 0,
	EDrawPolyPathWidthMode__Constant                                                 = 1
};

/// Enum /Script/MeshModelingTools.EDrawPolyPathOutputMode
/// Size: 0x04 (4 bytes)
enum class EDrawPolyPathOutputMode : uint32_t
{
	EDrawPolyPathOutputMode__Ribbon                                                  = 0,
	EDrawPolyPathOutputMode__Extrusion                                               = 1,
	EDrawPolyPathOutputMode__Ramp                                                    = 2
};

/// Enum /Script/MeshModelingTools.EDynamicMeshSculptBrushType
/// Size: 0x01 (1 bytes)
enum class EDynamicMeshSculptBrushType : uint8_t
{
	EDynamicMeshSculptBrushType__Move                                                = 0,
	EDynamicMeshSculptBrushType__PullKelvin                                          = 1,
	EDynamicMeshSculptBrushType__PullSharpKelvin                                     = 2,
	EDynamicMeshSculptBrushType__Smooth                                              = 3,
	EDynamicMeshSculptBrushType__Offset                                              = 4,
	EDynamicMeshSculptBrushType__SculptView                                          = 5,
	EDynamicMeshSculptBrushType__SculptMax                                           = 6,
	EDynamicMeshSculptBrushType__Inflate                                             = 7,
	EDynamicMeshSculptBrushType__ScaleKelvin                                         = 8,
	EDynamicMeshSculptBrushType__Pinch                                               = 9,
	EDynamicMeshSculptBrushType__TwistKelvin                                         = 10,
	EDynamicMeshSculptBrushType__Flatten                                             = 11,
	EDynamicMeshSculptBrushType__Plane                                               = 12,
	EDynamicMeshSculptBrushType__PlaneViewAligned                                    = 13,
	EDynamicMeshSculptBrushType__FixedPlane                                          = 14,
	EDynamicMeshSculptBrushType__Resample                                            = 15,
	EDynamicMeshSculptBrushType__LastValue                                           = 16
};

/// Enum /Script/MeshModelingTools.EEdgeLoopInsertionMode
/// Size: 0x04 (4 bytes)
enum class EEdgeLoopInsertionMode : uint32_t
{
	EEdgeLoopInsertionMode__Retriangulate                                            = 0,
	EEdgeLoopInsertionMode__PlaneCut                                                 = 1
};

/// Enum /Script/MeshModelingTools.EEdgeLoopPositioningMode
/// Size: 0x04 (4 bytes)
enum class EEdgeLoopPositioningMode : uint32_t
{
	EEdgeLoopPositioningMode__Even                                                   = 0,
	EEdgeLoopPositioningMode__ProportionOffset                                       = 1,
	EEdgeLoopPositioningMode__DistanceOffset                                         = 2
};

/// Enum /Script/MeshModelingTools.EPolyEditCutPlaneOrientation
/// Size: 0x04 (4 bytes)
enum class EPolyEditCutPlaneOrientation : uint32_t
{
	EPolyEditCutPlaneOrientation__FaceNormals                                        = 0,
	EPolyEditCutPlaneOrientation__ViewDirection                                      = 1
};

/// Enum /Script/MeshModelingTools.EPolyEditExtrudeDirection
/// Size: 0x04 (4 bytes)
enum class EPolyEditExtrudeDirection : uint32_t
{
	EPolyEditExtrudeDirection__SelectionNormal                                       = 0,
	EPolyEditExtrudeDirection__WorldX                                                = 1,
	EPolyEditExtrudeDirection__WorldY                                                = 2,
	EPolyEditExtrudeDirection__WorldZ                                                = 3,
	EPolyEditExtrudeDirection__LocalX                                                = 4,
	EPolyEditExtrudeDirection__LocalY                                                = 5,
	EPolyEditExtrudeDirection__LocalZ                                                = 6
};

/// Enum /Script/MeshModelingTools.EEditMeshPolygonsToolActions
/// Size: 0x01 (1 bytes)
enum class EEditMeshPolygonsToolActions : uint8_t
{
	EEditMeshPolygonsToolActions__NoAction                                           = 0,
	EEditMeshPolygonsToolActions__PlaneCut                                           = 1,
	EEditMeshPolygonsToolActions__Extrude                                            = 2,
	EEditMeshPolygonsToolActions__Offset                                             = 3,
	EEditMeshPolygonsToolActions__Inset                                              = 4,
	EEditMeshPolygonsToolActions__Outset                                             = 5,
	EEditMeshPolygonsToolActions__Merge                                              = 6,
	EEditMeshPolygonsToolActions__Delete                                             = 7,
	EEditMeshPolygonsToolActions__CutFaces                                           = 8,
	EEditMeshPolygonsToolActions__RecalculateNormals                                 = 9,
	EEditMeshPolygonsToolActions__FlipNormals                                        = 10,
	EEditMeshPolygonsToolActions__Retriangulate                                      = 11,
	EEditMeshPolygonsToolActions__Decompose                                          = 12,
	EEditMeshPolygonsToolActions__Disconnect                                         = 13,
	EEditMeshPolygonsToolActions__CollapseEdge                                       = 14,
	EEditMeshPolygonsToolActions__WeldEdges                                          = 15,
	EEditMeshPolygonsToolActions__StraightenEdge                                     = 16,
	EEditMeshPolygonsToolActions__FillHole                                           = 17,
	EEditMeshPolygonsToolActions__PlanarProjectionUV                                 = 18,
	EEditMeshPolygonsToolActions__PokeSingleFace                                     = 19,
	EEditMeshPolygonsToolActions__SplitSingleEdge                                    = 20,
	EEditMeshPolygonsToolActions__FlipSingleEdge                                     = 21,
	EEditMeshPolygonsToolActions__CollapseSingleEdge                                 = 22
};

/// Enum /Script/MeshModelingTools.ELocalFrameMode
/// Size: 0x04 (4 bytes)
enum class ELocalFrameMode : uint32_t
{
	ELocalFrameMode__FromObject                                                      = 0,
	ELocalFrameMode__FromGeometry                                                    = 1
};

/// Enum /Script/MeshModelingTools.EEditPivotToolActions
/// Size: 0x01 (1 bytes)
enum class EEditPivotToolActions : uint8_t
{
	EEditPivotToolActions__NoAction                                                  = 0,
	EEditPivotToolActions__Center                                                    = 1,
	EEditPivotToolActions__Bottom                                                    = 2,
	EEditPivotToolActions__Top                                                       = 3,
	EEditPivotToolActions__Left                                                      = 4,
	EEditPivotToolActions__Right                                                     = 5,
	EEditPivotToolActions__Front                                                     = 6,
	EEditPivotToolActions__Back                                                      = 7
};

/// Enum /Script/MeshModelingTools.EEditPivotSnapDragRotationMode
/// Size: 0x01 (1 bytes)
enum class EEditPivotSnapDragRotationMode : uint8_t
{
	EEditPivotSnapDragRotationMode__Ignore                                           = 0,
	EEditPivotSnapDragRotationMode__Align                                            = 1,
	EEditPivotSnapDragRotationMode__AlignFlipped                                     = 2,
	EEditPivotSnapDragRotationMode__LastValue                                        = 3
};

/// Enum /Script/MeshModelingTools.EGroupEdgeInsertionMode
/// Size: 0x04 (4 bytes)
enum class EGroupEdgeInsertionMode : uint32_t
{
	EGroupEdgeInsertionMode__Retriangulate                                           = 0,
	EGroupEdgeInsertionMode__PlaneCut                                                = 1
};

/// Enum /Script/MeshModelingTools.EHoleFillToolActions
/// Size: 0x01 (1 bytes)
enum class EHoleFillToolActions : uint8_t
{
	EHoleFillToolActions__NoAction                                                   = 0,
	EHoleFillToolActions__SelectAll                                                  = 1,
	EHoleFillToolActions__ClearSelection                                             = 2
};

/// Enum /Script/MeshModelingTools.EMeshAttributePaintToolActions
/// Size: 0x01 (1 bytes)
enum class EMeshAttributePaintToolActions : uint8_t
{
	EMeshAttributePaintToolActions__NoAction                                         = 0
};

/// Enum /Script/MeshModelingTools.EPlaneBrushSideMode
/// Size: 0x01 (1 bytes)
enum class EPlaneBrushSideMode : uint8_t
{
	EPlaneBrushSideMode__BothSides                                                   = 0,
	EPlaneBrushSideMode__PushDown                                                    = 1,
	EPlaneBrushSideMode__PullTowards                                                 = 2
};

/// Enum /Script/MeshModelingTools.EMeshEditingMaterialModes
/// Size: 0x04 (4 bytes)
enum class EMeshEditingMaterialModes : uint32_t
{
	EMeshEditingMaterialModes__ExistingMaterial                                      = 0,
	EMeshEditingMaterialModes__Diffuse                                               = 1,
	EMeshEditingMaterialModes__Grey                                                  = 2,
	EMeshEditingMaterialModes__Soft                                                  = 3,
	EMeshEditingMaterialModes__TangentNormal                                         = 4,
	EMeshEditingMaterialModes__Custom                                                = 5
};

/// Enum /Script/MeshModelingTools.ESetMeshMaterialMode
/// Size: 0x01 (1 bytes)
enum class ESetMeshMaterialMode : uint8_t
{
	ESetMeshMaterialMode__KeepOriginal                                               = 0,
	ESetMeshMaterialMode__Checkerboard                                               = 1,
	ESetMeshMaterialMode__Override                                                   = 2
};

/// Enum /Script/MeshModelingTools.EMeshSculptFalloffType
/// Size: 0x01 (1 bytes)
enum class EMeshSculptFalloffType : uint8_t
{
	EMeshSculptFalloffType__Smooth                                                   = 0,
	EMeshSculptFalloffType__Linear                                                   = 1,
	EMeshSculptFalloffType__Inverse                                                  = 2,
	EMeshSculptFalloffType__Round                                                    = 3,
	EMeshSculptFalloffType__BoxSmooth                                                = 4,
	EMeshSculptFalloffType__BoxLinear                                                = 5,
	EMeshSculptFalloffType__BoxInverse                                               = 6,
	EMeshSculptFalloffType__BoxRound                                                 = 7,
	EMeshSculptFalloffType__LastValue                                                = 8
};

/// Enum /Script/MeshModelingTools.EMeshFacesColorMode
/// Size: 0x04 (4 bytes)
enum class EMeshFacesColorMode : uint32_t
{
	EMeshFacesColorMode__None                                                        = 0,
	EMeshFacesColorMode__ByGroup                                                     = 1,
	EMeshFacesColorMode__ByMaterialID                                                = 2,
	EMeshFacesColorMode__ByUVIsland                                                  = 3
};

/// Enum /Script/MeshModelingTools.EMeshSelectionToolPrimaryMode
/// Size: 0x04 (4 bytes)
enum class EMeshSelectionToolPrimaryMode : uint32_t
{
	EMeshSelectionToolPrimaryMode__Brush                                             = 0,
	EMeshSelectionToolPrimaryMode__VolumetricBrush                                   = 1,
	EMeshSelectionToolPrimaryMode__AngleFiltered                                     = 2,
	EMeshSelectionToolPrimaryMode__Visible                                           = 3,
	EMeshSelectionToolPrimaryMode__AllConnected                                      = 4,
	EMeshSelectionToolPrimaryMode__AllInGroup                                        = 5,
	EMeshSelectionToolPrimaryMode__ByMaterial                                        = 6,
	EMeshSelectionToolPrimaryMode__ByUVIsland                                        = 7,
	EMeshSelectionToolPrimaryMode__AllWithinAngle                                    = 8
};

/// Enum /Script/MeshModelingTools.EMeshSelectionToolActions
/// Size: 0x01 (1 bytes)
enum class EMeshSelectionToolActions : uint8_t
{
	EMeshSelectionToolActions__NoAction                                              = 0,
	EMeshSelectionToolActions__SelectAll                                             = 1,
	EMeshSelectionToolActions__ClearSelection                                        = 2,
	EMeshSelectionToolActions__InvertSelection                                       = 3,
	EMeshSelectionToolActions__GrowSelection                                         = 4,
	EMeshSelectionToolActions__ShrinkSelection                                       = 5,
	EMeshSelectionToolActions__ExpandToConnected                                     = 6,
	EMeshSelectionToolActions__SelectLargestComponentByTriCount                      = 7,
	EMeshSelectionToolActions__SelectLargestComponentByArea                          = 8,
	EMeshSelectionToolActions__OptimizeSelection                                     = 9,
	EMeshSelectionToolActions__DeleteSelected                                        = 10,
	EMeshSelectionToolActions__DisconnectSelected                                    = 11,
	EMeshSelectionToolActions__SeparateSelected                                      = 12,
	EMeshSelectionToolActions__FlipSelected                                          = 13,
	EMeshSelectionToolActions__CreateGroup                                           = 14,
	EMeshSelectionToolActions__CycleSelectionMode                                    = 15,
	EMeshSelectionToolActions__CycleViewMode                                         = 16
};

/// Enum /Script/MeshModelingTools.ENonlinearOperationType
/// Size: 0x01 (1 bytes)
enum class ENonlinearOperationType : uint8_t
{
	ENonlinearOperationType__Bend                                                    = 0,
	ENonlinearOperationType__Flare                                                   = 1,
	ENonlinearOperationType__Twist                                                   = 2
};

/// Enum /Script/MeshModelingTools.EMeshVertexSculptBrushType
/// Size: 0x01 (1 bytes)
enum class EMeshVertexSculptBrushType : uint8_t
{
	EMeshVertexSculptBrushType__Move                                                 = 0,
	EMeshVertexSculptBrushType__PullKelvin                                           = 1,
	EMeshVertexSculptBrushType__PullSharpKelvin                                      = 2,
	EMeshVertexSculptBrushType__Smooth                                               = 3,
	EMeshVertexSculptBrushType__SmoothFill                                           = 4,
	EMeshVertexSculptBrushType__Offset                                               = 5,
	EMeshVertexSculptBrushType__SculptView                                           = 6,
	EMeshVertexSculptBrushType__SculptMax                                            = 7,
	EMeshVertexSculptBrushType__Inflate                                              = 8,
	EMeshVertexSculptBrushType__ScaleKelvin                                          = 9,
	EMeshVertexSculptBrushType__Pinch                                                = 10,
	EMeshVertexSculptBrushType__TwistKelvin                                          = 11,
	EMeshVertexSculptBrushType__Flatten                                              = 12,
	EMeshVertexSculptBrushType__Plane                                                = 13,
	EMeshVertexSculptBrushType__PlaneViewAligned                                     = 14,
	EMeshVertexSculptBrushType__FixedPlane                                           = 15,
	EMeshVertexSculptBrushType__LastValue                                            = 16
};

/// Enum /Script/MeshModelingTools.EMirrorToolAction
/// Size: 0x01 (1 bytes)
enum class EMirrorToolAction : uint8_t
{
	EMirrorToolAction__NoAction                                                      = 0,
	EMirrorToolAction__ShiftToCenter                                                 = 1,
	EMirrorToolAction__Left                                                          = 2,
	EMirrorToolAction__Right                                                         = 3,
	EMirrorToolAction__Up                                                            = 4,
	EMirrorToolAction__Down                                                          = 5,
	EMirrorToolAction__Forward                                                       = 6,
	EMirrorToolAction__Backward                                                      = 7
};

/// Enum /Script/MeshModelingTools.EMirrorCtrlClickBehavior
/// Size: 0x01 (1 bytes)
enum class EMirrorCtrlClickBehavior : uint8_t
{
	EMirrorCtrlClickBehavior__Reposition                                             = 0,
	EMirrorCtrlClickBehavior__RepositionAndReorient                                  = 1
};

/// Enum /Script/MeshModelingTools.EMirrorOperationMode
/// Size: 0x01 (1 bytes)
enum class EMirrorOperationMode : uint8_t
{
	EMirrorOperationMode__MirrorAndAppend                                            = 0,
	EMirrorOperationMode__MirrorExisting                                             = 1
};

/// Enum /Script/MeshModelingTools.EMirrorSaveMode
/// Size: 0x01 (1 bytes)
enum class EMirrorSaveMode : uint8_t
{
	EMirrorSaveMode__UpdateAssets                                                    = 0,
	EMirrorSaveMode__CreateNewAssets                                                 = 1
};

/// Enum /Script/MeshModelingTools.EOffsetMeshToolOffsetType
/// Size: 0x01 (1 bytes)
enum class EOffsetMeshToolOffsetType : uint8_t
{
	EOffsetMeshToolOffsetType__Iterative                                             = 0,
	EOffsetMeshToolOffsetType__Implicit                                              = 1
};

/// Enum /Script/MeshModelingTools.EMaterialBoundaryConstraint
/// Size: 0x01 (1 bytes)
enum class EMaterialBoundaryConstraint : uint8_t
{
	EMaterialBoundaryConstraint__Fixed                                               = 7,
	EMaterialBoundaryConstraint__Refine                                              = 5,
	EMaterialBoundaryConstraint__Free                                                = 1,
	EMaterialBoundaryConstraint__Ignore                                              = 0
};

/// Enum /Script/MeshModelingTools.EGroupBoundaryConstraint
/// Size: 0x01 (1 bytes)
enum class EGroupBoundaryConstraint : uint8_t
{
	EGroupBoundaryConstraint__Fixed                                                  = 7,
	EGroupBoundaryConstraint__Refine                                                 = 5,
	EGroupBoundaryConstraint__Free                                                   = 1,
	EGroupBoundaryConstraint__Ignore                                                 = 0
};

/// Enum /Script/MeshModelingTools.EMeshBoundaryConstraint
/// Size: 0x01 (1 bytes)
enum class EMeshBoundaryConstraint : uint8_t
{
	EMeshBoundaryConstraint__Fixed                                                   = 7,
	EMeshBoundaryConstraint__Refine                                                  = 5,
	EMeshBoundaryConstraint__Free                                                    = 1
};

/// Enum /Script/MeshModelingTools.EOcclusionCalculationUIMode
/// Size: 0x01 (1 bytes)
enum class EOcclusionCalculationUIMode : uint8_t
{
	EOcclusionCalculationUIMode__GeneralizedWindingNumber                            = 0,
	EOcclusionCalculationUIMode__RaycastOcclusionSamples                             = 1
};

/// Enum /Script/MeshModelingTools.EOcclusionTriangleSamplingUIMode
/// Size: 0x01 (1 bytes)
enum class EOcclusionTriangleSamplingUIMode : uint8_t
{
	EOcclusionTriangleSamplingUIMode__Vertices                                       = 0,
	EOcclusionTriangleSamplingUIMode__VerticesAndCentroids                           = 1
};

/// Enum /Script/MeshModelingTools.ERevolvePropertiesQuadSplit
/// Size: 0x01 (1 bytes)
enum class ERevolvePropertiesQuadSplit : uint8_t
{
	ERevolvePropertiesQuadSplit__Uniform                                             = 0,
	ERevolvePropertiesQuadSplit__ShortestDiagonal                                    = 1
};

/// Enum /Script/MeshModelingTools.ERevolvePropertiesPolygroupMode
/// Size: 0x01 (1 bytes)
enum class ERevolvePropertiesPolygroupMode : uint8_t
{
	ERevolvePropertiesPolygroupMode__Single                                          = 0,
	ERevolvePropertiesPolygroupMode__PerFace                                         = 1,
	ERevolvePropertiesPolygroupMode__PerStep                                         = 2,
	ERevolvePropertiesPolygroupMode__AccordingToProfileCurve                         = 3
};

/// Enum /Script/MeshModelingTools.ERevolvePropertiesCapFillMode
/// Size: 0x01 (1 bytes)
enum class ERevolvePropertiesCapFillMode : uint8_t
{
	ERevolvePropertiesCapFillMode__None                                              = 0,
	ERevolvePropertiesCapFillMode__Delaunay                                          = 1,
	ERevolvePropertiesCapFillMode__EarClipping                                       = 2,
	ERevolvePropertiesCapFillMode__CenterFan                                         = 3
};

/// Enum /Script/MeshModelingTools.EProjectedHullAxis
/// Size: 0x04 (4 bytes)
enum class EProjectedHullAxis : uint32_t
{
	EProjectedHullAxis__X                                                            = 0,
	EProjectedHullAxis__Y                                                            = 1,
	EProjectedHullAxis__Z                                                            = 2,
	EProjectedHullAxis__SmallestBoxDimension                                         = 3,
	EProjectedHullAxis__SmallestVolume                                               = 4
};

/// Enum /Script/MeshModelingTools.ECollisionGeometryType
/// Size: 0x04 (4 bytes)
enum class ECollisionGeometryType : uint32_t
{
	ECollisionGeometryType__KeepExisting                                             = 0,
	ECollisionGeometryType__AlignedBoxes                                             = 1,
	ECollisionGeometryType__OrientedBoxes                                            = 2,
	ECollisionGeometryType__MinimalSpheres                                           = 3,
	ECollisionGeometryType__Capsules                                                 = 4,
	ECollisionGeometryType__ConvexHulls                                              = 5,
	ECollisionGeometryType__SweptHulls                                               = 6,
	ECollisionGeometryType__MinVolume                                                = 10,
	ECollisionGeometryType__None                                                     = 11
};

/// Enum /Script/MeshModelingTools.ESetCollisionGeometryInputMode
/// Size: 0x04 (4 bytes)
enum class ESetCollisionGeometryInputMode : uint32_t
{
	ESetCollisionGeometryInputMode__CombineAll                                       = 0,
	ESetCollisionGeometryInputMode__PerInputObject                                   = 1,
	ESetCollisionGeometryInputMode__PerMeshComponent                                 = 2,
	ESetCollisionGeometryInputMode__PerMeshGroup                                     = 3
};

/// Enum /Script/MeshModelingTools.ESmoothMeshToolSmoothType
/// Size: 0x01 (1 bytes)
enum class ESmoothMeshToolSmoothType : uint8_t
{
	ESmoothMeshToolSmoothType__Iterative                                             = 0,
	ESmoothMeshToolSmoothType__Implicit                                              = 1,
	ESmoothMeshToolSmoothType__Diffusion                                             = 2
};

/// Enum /Script/MeshModelingTools.ETransformMeshesSnapDragRotationMode
/// Size: 0x01 (1 bytes)
enum class ETransformMeshesSnapDragRotationMode : uint8_t
{
	ETransformMeshesSnapDragRotationMode__Ignore                                     = 0,
	ETransformMeshesSnapDragRotationMode__Align                                      = 1,
	ETransformMeshesSnapDragRotationMode__AlignFlipped                               = 2,
	ETransformMeshesSnapDragRotationMode__LastValue                                  = 3
};

/// Enum /Script/MeshModelingTools.ETransformMeshesSnapDragSource
/// Size: 0x01 (1 bytes)
enum class ETransformMeshesSnapDragSource : uint8_t
{
	ETransformMeshesSnapDragSource__ClickPoint                                       = 0,
	ETransformMeshesSnapDragSource__Pivot                                            = 1,
	ETransformMeshesSnapDragSource__LastValue                                        = 2
};

/// Enum /Script/MeshModelingTools.ETransformMeshesTransformMode
/// Size: 0x01 (1 bytes)
enum class ETransformMeshesTransformMode : uint8_t
{
	ETransformMeshesTransformMode__SharedGizmo                                       = 0,
	ETransformMeshesTransformMode__SharedGizmoLocal                                  = 1,
	ETransformMeshesTransformMode__PerObjectGizmo                                    = 2,
	ETransformMeshesTransformMode__LastValue                                         = 3
};

#pragma pack(pop)


static_assert(sizeof(UAddPatchToolBuilder) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(UAddPatchToolProperties) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UAddPatchTool) == 0x0100); // 256 bytes (0x000088 - 0x000100)
static_assert(sizeof(UAddPrimitiveToolBuilder) == 0x0038); // 56 bytes (0x000028 - 0x000038)
static_assert(sizeof(UProceduralShapeToolProperties) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UProceduralRectangleToolProperties) == 0x0080); // 128 bytes (0x000070 - 0x000080)
static_assert(sizeof(UProceduralBoxToolProperties) == 0x0088); // 136 bytes (0x000080 - 0x000088)
static_assert(sizeof(UProceduralRoundedRectangleToolProperties) == 0x0088); // 136 bytes (0x000080 - 0x000088)
static_assert(sizeof(UProceduralDiscToolProperties) == 0x0080); // 128 bytes (0x000070 - 0x000080)
static_assert(sizeof(UProceduralPuncturedDiscToolProperties) == 0x0088); // 136 bytes (0x000080 - 0x000088)
static_assert(sizeof(UProceduralTorusToolProperties) == 0x0080); // 128 bytes (0x000070 - 0x000080)
static_assert(sizeof(UProceduralCylinderToolProperties) == 0x0080); // 128 bytes (0x000070 - 0x000080)
static_assert(sizeof(UProceduralConeToolProperties) == 0x0080); // 128 bytes (0x000070 - 0x000080)
static_assert(sizeof(UProceduralArrowToolProperties) == 0x0088); // 136 bytes (0x000070 - 0x000088)
static_assert(sizeof(UProceduralSphereToolProperties) == 0x0080); // 128 bytes (0x000070 - 0x000080)
static_assert(sizeof(UProceduralSphericalBoxToolProperties) == 0x0078); // 120 bytes (0x000070 - 0x000078)
static_assert(sizeof(ULastActorInfo) == 0x0058); // 88 bytes (0x000028 - 0x000058)
static_assert(sizeof(UAddPrimitiveTool) == 0x00F0); // 240 bytes (0x000088 - 0x0000F0)
static_assert(sizeof(UAddBoxPrimitiveTool) == 0x00F0); // 240 bytes (0x0000F0 - 0x0000F0)
static_assert(sizeof(UAddCylinderPrimitiveTool) == 0x00F0); // 240 bytes (0x0000F0 - 0x0000F0)
static_assert(sizeof(UAddConePrimitiveTool) == 0x00F0); // 240 bytes (0x0000F0 - 0x0000F0)
static_assert(sizeof(UAddRectanglePrimitiveTool) == 0x00F0); // 240 bytes (0x0000F0 - 0x0000F0)
static_assert(sizeof(UAddRoundedRectanglePrimitiveTool) == 0x00F0); // 240 bytes (0x0000F0 - 0x0000F0)
static_assert(sizeof(UAddDiscPrimitiveTool) == 0x00F0); // 240 bytes (0x0000F0 - 0x0000F0)
static_assert(sizeof(UAddPuncturedDiscPrimitiveTool) == 0x00F0); // 240 bytes (0x0000F0 - 0x0000F0)
static_assert(sizeof(UAddTorusPrimitiveTool) == 0x00F0); // 240 bytes (0x0000F0 - 0x0000F0)
static_assert(sizeof(UAddArrowPrimitiveTool) == 0x00F0); // 240 bytes (0x0000F0 - 0x0000F0)
static_assert(sizeof(UAddSpherePrimitiveTool) == 0x00F0); // 240 bytes (0x0000F0 - 0x0000F0)
static_assert(sizeof(UAddSphericalBoxPrimitiveTool) == 0x00F0); // 240 bytes (0x0000F0 - 0x0000F0)
static_assert(sizeof(UAlignObjectsToolBuilder) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UAlignObjectsToolProperties) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UAlignObjectsTool) == 0x0140); // 320 bytes (0x000090 - 0x000140)
static_assert(sizeof(UBakeMeshAttributeMapsToolBuilder) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(UBakeMeshAttributeMapsToolProperties) == 0x00A0); // 160 bytes (0x000060 - 0x0000A0)
static_assert(sizeof(UBakedNormalMapToolProperties) == 0x0060); // 96 bytes (0x000060 - 0x000060)
static_assert(sizeof(UBakedOcclusionMapToolProperties) == 0x0088); // 136 bytes (0x000060 - 0x000088)
static_assert(sizeof(UBakedOcclusionMapVisualizationProperties) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UBakedCurvatureMapToolProperties) == 0x0080); // 128 bytes (0x000060 - 0x000080)
static_assert(sizeof(UBakedTexture2DImageProperties) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UBakeMeshAttributeMapsTool) == 0x04F8); // 1272 bytes (0x000090 - 0x0004F8)
static_assert(sizeof(UBakeTransformToolBuilder) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(UBakeTransformToolProperties) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UBakeTransformTool) == 0x00B8); // 184 bytes (0x000090 - 0x0000B8)
static_assert(sizeof(FPhysicsSphereData) == 0x0070); // 112 bytes (0x000000 - 0x000070)
static_assert(sizeof(FPhysicsBoxData) == 0x0070); // 112 bytes (0x000000 - 0x000070)
static_assert(sizeof(FPhysicsCapsuleData) == 0x0070); // 112 bytes (0x000000 - 0x000070)
static_assert(sizeof(FPhysicsConvexData) == 0x0038); // 56 bytes (0x000000 - 0x000038)
static_assert(sizeof(UPhysicsObjectToolPropertySet) == 0x00B8); // 184 bytes (0x000060 - 0x0000B8)
static_assert(sizeof(UCollisionGeometryVisualizationProperties) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UCombineMeshesToolBuilder) == 0x0038); // 56 bytes (0x000028 - 0x000038)
static_assert(sizeof(UCombineMeshesToolProperties) == 0x0088); // 136 bytes (0x000060 - 0x000088)
static_assert(sizeof(UCombineMeshesTool) == 0x00B8); // 184 bytes (0x000090 - 0x0000B8)
static_assert(sizeof(UConvertToPolygonsToolBuilder) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UConvertToPolygonsToolProperties) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UConvertToPolygonsTool) == 0x03E0); // 992 bytes (0x000088 - 0x0003E0)
static_assert(sizeof(UCSGMeshesToolProperties) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UCSGMeshesTool) == 0x0120); // 288 bytes (0x0000F0 - 0x000120)
static_assert(sizeof(UCSGMeshesToolBuilder) == 0x0030); // 48 bytes (0x000030 - 0x000030)
static_assert(sizeof(UDeformMeshPolygonsToolBuilder) == 0x0030); // 48 bytes (0x000030 - 0x000030)
static_assert(sizeof(UDeformMeshPolygonsTransformProperties) == 0x0080); // 128 bytes (0x000060 - 0x000080)
static_assert(sizeof(UDeformMeshPolygonsTool) == 0x13C0); // 5056 bytes (0x0000C0 - 0x0013C0)
static_assert(sizeof(UDisplaceMeshCommonProperties) == 0x0090); // 144 bytes (0x000060 - 0x000090)
static_assert(sizeof(UDisplaceMeshTextureMapProperties) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UDisplaceMeshDirectionalFilterProperties) == 0x0078); // 120 bytes (0x000060 - 0x000078)
static_assert(sizeof(FPerlinLayerProperties) == 0x0008); // 8 bytes (0x000000 - 0x000008)
static_assert(sizeof(UDisplaceMeshPerlinNoiseProperties) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UDisplaceMeshSineWaveProperties) == 0x0078); // 120 bytes (0x000060 - 0x000078)
static_assert(sizeof(UDisplaceMeshToolBuilder) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UDisplaceMeshTool) == 0x03F0); // 1008 bytes (0x000088 - 0x0003F0)
static_assert(sizeof(UDrawAndRevolveToolBuilder) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(URevolveProperties) == 0x00B0); // 176 bytes (0x000060 - 0x0000B0)
static_assert(sizeof(URevolveToolProperties) == 0x00D0); // 208 bytes (0x0000B0 - 0x0000D0)
static_assert(sizeof(URevolveOperatorFactory) == 0x0038); // 56 bytes (0x000028 - 0x000038)
static_assert(sizeof(UDrawAndRevolveTool) == 0x0120); // 288 bytes (0x000080 - 0x000120)
static_assert(sizeof(UDrawPolygonToolBuilder) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(UDrawPolygonToolStandardProperties) == 0x0078); // 120 bytes (0x000060 - 0x000078)
static_assert(sizeof(UDrawPolygonToolSnapProperties) == 0x0078); // 120 bytes (0x000060 - 0x000078)
static_assert(sizeof(UDrawPolygonTool) == 0x0570); // 1392 bytes (0x000080 - 0x000570)
static_assert(sizeof(UDrawPolyPathToolBuilder) == 0x0038); // 56 bytes (0x000030 - 0x000038)
static_assert(sizeof(UDrawPolyPathProperties) == 0x0080); // 128 bytes (0x000060 - 0x000080)
static_assert(sizeof(UDrawPolyPathExtrudeProperties) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UDrawPolyPathTool) == 0x0210); // 528 bytes (0x000080 - 0x000210)
static_assert(sizeof(UDynamicMeshBrushTool) == 0x0208); // 520 bytes (0x0001C8 - 0x000208)
static_assert(sizeof(UDynamicMeshSculptToolBuilder) == 0x0038); // 56 bytes (0x000030 - 0x000038)
static_assert(sizeof(UBrushSculptProperties) == 0x0078); // 120 bytes (0x000060 - 0x000078)
static_assert(sizeof(UDynamicSculptToolActions) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UMeshConstraintProperties) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(URemeshProperties) == 0x0070); // 112 bytes (0x000068 - 0x000070)
static_assert(sizeof(UBrushRemeshProperties) == 0x0080); // 128 bytes (0x000070 - 0x000080)
static_assert(sizeof(UFixedPlaneBrushProperties) == 0x0080); // 128 bytes (0x000060 - 0x000080)
static_assert(sizeof(UDynamicMeshSculptTool) == 0x0D20); // 3360 bytes (0x0000C0 - 0x000D20)
static_assert(sizeof(UEdgeLoopInsertionToolBuilder) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(UEdgeLoopInsertionProperties) == 0x0090); // 144 bytes (0x000060 - 0x000090)
static_assert(sizeof(UEdgeLoopInsertionOperatorFactory) == 0x0038); // 56 bytes (0x000028 - 0x000038)
static_assert(sizeof(UEdgeLoopInsertionTool) == 0x0500); // 1280 bytes (0x000088 - 0x000500)
static_assert(sizeof(UEditMeshPolygonsToolBuilder) == 0x0038); // 56 bytes (0x000030 - 0x000038)
static_assert(sizeof(UPolyEditCommonProperties) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UEditMeshPolygonsToolActionPropertySet) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UEditMeshPolygonsToolActions) == 0x0068); // 104 bytes (0x000068 - 0x000068)
static_assert(sizeof(UEditMeshPolygonsToolActions_Triangles) == 0x0068); // 104 bytes (0x000068 - 0x000068)
static_assert(sizeof(UEditMeshPolygonsToolUVActions) == 0x0068); // 104 bytes (0x000068 - 0x000068)
static_assert(sizeof(UEditMeshPolygonsToolEdgeActions) == 0x0068); // 104 bytes (0x000068 - 0x000068)
static_assert(sizeof(UEditMeshPolygonsToolEdgeActions_Triangles) == 0x0068); // 104 bytes (0x000068 - 0x000068)
static_assert(sizeof(UPolyEditExtrudeProperties) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UPolyEditOffsetProperties) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UPolyEditInsetProperties) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UPolyEditOutsetProperties) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UPolyEditCutProperties) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UPolyEditSetUVProperties) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UEditMeshPolygonsTool) == 0x07D0); // 2000 bytes (0x0000C0 - 0x0007D0)
static_assert(sizeof(UEditNormalsToolBuilder) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(UEditNormalsToolProperties) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UEditNormalsAdvancedProperties) == 0x0060); // 96 bytes (0x000060 - 0x000060)
static_assert(sizeof(UEditNormalsOperatorFactory) == 0x0040); // 64 bytes (0x000028 - 0x000040)
static_assert(sizeof(UEditNormalsTool) == 0x0100); // 256 bytes (0x000090 - 0x000100)
static_assert(sizeof(UEditPivotToolBuilder) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UEditPivotToolProperties) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UEditPivotToolActionPropertySet) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(FEditPivotTarget) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(UEditPivotTool) == 0x0200); // 512 bytes (0x000090 - 0x000200)
static_assert(sizeof(UEditUVIslandsToolBuilder) == 0x0030); // 48 bytes (0x000030 - 0x000030)
static_assert(sizeof(UEditUVIslandsTool) == 0x0380); // 896 bytes (0x0000C0 - 0x000380)
static_assert(sizeof(UExtractCollisionGeometryToolBuilder) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(UExtractCollisionGeometryTool) == 0x0330); // 816 bytes (0x000088 - 0x000330)
static_assert(sizeof(UGroupEdgeInsertionToolBuilder) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(UGroupEdgeInsertionProperties) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UGroupEdgeInsertionOperatorFactory) == 0x0038); // 56 bytes (0x000028 - 0x000038)
static_assert(sizeof(UGroupEdgeInsertionTool) == 0x0550); // 1360 bytes (0x000088 - 0x000550)
static_assert(sizeof(UHoleFillToolBuilder) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(USmoothHoleFillProperties) == 0x0088); // 136 bytes (0x000060 - 0x000088)
static_assert(sizeof(UHoleFillToolProperties) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UHoleFillToolActions) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UHoleFillStatisticsProperties) == 0x00B0); // 176 bytes (0x000060 - 0x0000B0)
static_assert(sizeof(UHoleFillOperatorFactory) == 0x0038); // 56 bytes (0x000028 - 0x000038)
static_assert(sizeof(UHoleFillTool) == 0x01E0); // 480 bytes (0x000088 - 0x0001E0)
static_assert(sizeof(UMeshSculptBrushOpProps) == 0x0060); // 96 bytes (0x000060 - 0x000060)
static_assert(sizeof(UBaseKelvinletBrushOpProps) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UScaleKelvinletBrushOpProps) == 0x0078); // 120 bytes (0x000070 - 0x000078)
static_assert(sizeof(UPullKelvinletBrushOpProps) == 0x0078); // 120 bytes (0x000070 - 0x000078)
static_assert(sizeof(USharpPullKelvinletBrushOpProps) == 0x0078); // 120 bytes (0x000070 - 0x000078)
static_assert(sizeof(UTwistKelvinletBrushOpProps) == 0x0078); // 120 bytes (0x000070 - 0x000078)
static_assert(sizeof(UMeshAnalysisProperties) == 0x0080); // 128 bytes (0x000060 - 0x000080)
static_assert(sizeof(UMeshAttributePaintToolBuilder) == 0x0080); // 128 bytes (0x000030 - 0x000080)
static_assert(sizeof(UMeshAttributePaintToolProperties) == 0x0088); // 136 bytes (0x000060 - 0x000088)
static_assert(sizeof(UMeshAttributePaintEditActions) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UMeshAttributePaintTool) == 0x0640); // 1600 bytes (0x000208 - 0x000640)
static_assert(sizeof(UMeshBoundaryToolBase) == 0x0150); // 336 bytes (0x000088 - 0x000150)
static_assert(sizeof(UInflateBrushOpProps) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UMeshInspectorToolBuilder) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UMeshInspectorProperties) == 0x0078); // 120 bytes (0x000060 - 0x000078)
static_assert(sizeof(UMeshInspectorTool) == 0x0128); // 296 bytes (0x000088 - 0x000128)
static_assert(sizeof(UNewMeshMaterialProperties) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UExistingMeshMaterialProperties) == 0x0078); // 120 bytes (0x000060 - 0x000078)
static_assert(sizeof(UMeshEditingViewProperties) == 0x0088); // 136 bytes (0x000060 - 0x000088)
static_assert(sizeof(UMoveBrushOpProps) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UPinchBrushOpProps) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UBasePlaneBrushOpProps) == 0x0060); // 96 bytes (0x000060 - 0x000060)
static_assert(sizeof(UPlaneBrushOpProps) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UViewAlignedPlaneBrushOpProps) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UFixedPlaneBrushOpProps) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UStandardSculptBrushOpProps) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UViewAlignedSculptBrushOpProps) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(USculptMaxBrushOpProps) == 0x0078); // 120 bytes (0x000060 - 0x000078)
static_assert(sizeof(USculptBrushProperties) == 0x0088); // 136 bytes (0x000078 - 0x000088)
static_assert(sizeof(UKelvinBrushProperties) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UWorkPlaneProperties) == 0x0080); // 128 bytes (0x000060 - 0x000080)
static_assert(sizeof(USculptMaxBrushProperties) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UMeshSculptToolBase) == 0x09D8); // 2520 bytes (0x0000C0 - 0x0009D8)
static_assert(sizeof(UMeshSelectionToolBuilder) == 0x0038); // 56 bytes (0x000030 - 0x000038)
static_assert(sizeof(UMeshSelectionToolActionPropertySet) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UMeshSelectionEditActions) == 0x0068); // 104 bytes (0x000068 - 0x000068)
static_assert(sizeof(UMeshSelectionMeshEditActions) == 0x0068); // 104 bytes (0x000068 - 0x000068)
static_assert(sizeof(UMeshSelectionToolProperties) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UMeshSelectionTool) == 0x04C0); // 1216 bytes (0x000208 - 0x0004C0)
static_assert(sizeof(UBaseSmoothBrushOpProps) == 0x0060); // 96 bytes (0x000060 - 0x000060)
static_assert(sizeof(USmoothBrushOpProps) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(USecondarySmoothBrushOpProps) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(USmoothFillBrushOpProps) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UFlattenBrushOpProps) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UEraseBrushOpProps) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UMeshSpaceDeformerToolBuilder) == 0x0030); // 48 bytes (0x000030 - 0x000030)
static_assert(sizeof(USpaceDeformerOperatorFactory) == 0x0038); // 56 bytes (0x000028 - 0x000038)
static_assert(sizeof(UMeshSpaceDeformerTool) == 0x01C0); // 448 bytes (0x0000C0 - 0x0001C0)
static_assert(sizeof(UMeshStatisticsProperties) == 0x0090); // 144 bytes (0x000060 - 0x000090)
static_assert(sizeof(UMeshVertexSculptToolBuilder) == 0x0030); // 48 bytes (0x000030 - 0x000030)
static_assert(sizeof(UVertexBrushSculptProperties) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UMeshVertexSculptTool) == 0x1230); // 4656 bytes (0x0009D8 - 0x001230)
static_assert(sizeof(UMirrorToolBuilder) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(UMirrorToolProperties) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UMirrorOperatorFactory) == 0x0040); // 64 bytes (0x000028 - 0x000040)
static_assert(sizeof(UMirrorToolActionPropertySet) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UMirrorTool) == 0x0138); // 312 bytes (0x000090 - 0x000138)
static_assert(sizeof(UOffsetMeshToolProperties) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UOffsetWeightMapSetProperties) == 0x0088); // 136 bytes (0x000080 - 0x000088)
static_assert(sizeof(UIterativeOffsetProperties) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UImplicitOffsetProperties) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UOffsetMeshTool) == 0x0420); // 1056 bytes (0x000400 - 0x000420)
static_assert(sizeof(UOffsetMeshToolBuilder) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UPhysicsInspectorToolBuilder) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UPhysicsInspectorTool) == 0x00D8); // 216 bytes (0x000090 - 0x0000D8)
static_assert(sizeof(UPlaneCutToolBuilder) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(UAcceptOutputProperties) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UPlaneCutToolProperties) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UPlaneCutOperatorFactory) == 0x0040); // 64 bytes (0x000028 - 0x000040)
static_assert(sizeof(UPlaneCutTool) == 0x0160); // 352 bytes (0x000090 - 0x000160)
static_assert(sizeof(UPositionPlaneGizmoBuilder) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UPositionPlaneGizmo) == 0x0520); // 1312 bytes (0x000038 - 0x000520)
static_assert(sizeof(UPositionPlaneOnSceneInputBehavior) == 0x00B0); // 176 bytes (0x000080 - 0x0000B0)
static_assert(sizeof(UProjectToTargetToolBuilder) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(URemeshMeshToolProperties) == 0x0090); // 144 bytes (0x000070 - 0x000090)
static_assert(sizeof(UProjectToTargetToolProperties) == 0x0090); // 144 bytes (0x000090 - 0x000090)
static_assert(sizeof(URemeshMeshTool) == 0x00E8); // 232 bytes (0x000090 - 0x0000E8)
static_assert(sizeof(UProjectToTargetTool) == 0x00F8); // 248 bytes (0x0000E8 - 0x0000F8)
static_assert(sizeof(URemeshMeshToolBuilder) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(URemoveOccludedTrianglesToolBuilder) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(URemoveOccludedTrianglesToolProperties) == 0x0080); // 128 bytes (0x000060 - 0x000080)
static_assert(sizeof(URemoveOccludedTrianglesAdvancedProperties) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(URemoveOccludedTrianglesOperatorFactory) == 0x0040); // 64 bytes (0x000028 - 0x000040)
static_assert(sizeof(URemoveOccludedTrianglesTool) == 0x0150); // 336 bytes (0x000090 - 0x000150)
static_assert(sizeof(URevolveBoundaryToolBuilder) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(URevolveBoundaryOperatorFactory) == 0x0038); // 56 bytes (0x000028 - 0x000038)
static_assert(sizeof(URevolveBoundaryToolProperties) == 0x00D0); // 208 bytes (0x0000B0 - 0x0000D0)
static_assert(sizeof(URevolveBoundaryTool) == 0x01B0); // 432 bytes (0x000150 - 0x0001B0)
static_assert(sizeof(USeamSculptToolBuilder) == 0x0030); // 48 bytes (0x000030 - 0x000030)
static_assert(sizeof(USeamSculptToolProperties) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(USeamSculptTool) == 0x02E8); // 744 bytes (0x000208 - 0x0002E8)
static_assert(sizeof(USelfUnionMeshesToolProperties) == 0x0078); // 120 bytes (0x000060 - 0x000078)
static_assert(sizeof(USelfUnionMeshesTool) == 0x0120); // 288 bytes (0x0000F0 - 0x000120)
static_assert(sizeof(USelfUnionMeshesToolBuilder) == 0x0030); // 48 bytes (0x000030 - 0x000030)
static_assert(sizeof(USetCollisionGeometryToolBuilder) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(USetCollisionGeometryToolProperties) == 0x0090); // 144 bytes (0x000060 - 0x000090)
static_assert(sizeof(USetCollisionGeometryTool) == 0x01C0); // 448 bytes (0x000090 - 0x0001C0)
static_assert(sizeof(USmoothMeshToolProperties) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(UIterativeSmoothProperties) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UDiffusionSmoothProperties) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(UImplicitSmoothProperties) == 0x0070); // 112 bytes (0x000060 - 0x000070)
static_assert(sizeof(USmoothWeightMapSetProperties) == 0x0088); // 136 bytes (0x000080 - 0x000088)
static_assert(sizeof(USmoothMeshTool) == 0x0430); // 1072 bytes (0x000400 - 0x000430)
static_assert(sizeof(USmoothMeshToolBuilder) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UTransformMeshesToolBuilder) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UTransformMeshesToolProperties) == 0x0068); // 104 bytes (0x000060 - 0x000068)
static_assert(sizeof(FTransformMeshesTarget) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(UTransformMeshesTool) == 0x0140); // 320 bytes (0x000090 - 0x000140)
static_assert(sizeof(UUVProjectionToolBuilder) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(UUVProjectionToolProperties) == 0x0088); // 136 bytes (0x000060 - 0x000088)
static_assert(sizeof(UUVProjectionAdvancedProperties) == 0x0060); // 96 bytes (0x000060 - 0x000060)
static_assert(sizeof(UUVProjectionOperatorFactory) == 0x0040); // 64 bytes (0x000028 - 0x000040)
static_assert(sizeof(UUVProjectionTool) == 0x0220); // 544 bytes (0x000090 - 0x000220)
static_assert(sizeof(UVoxelBlendMeshesToolProperties) == 0x0080); // 128 bytes (0x000060 - 0x000080)
static_assert(sizeof(UVoxelBlendMeshesTool) == 0x0110); // 272 bytes (0x000108 - 0x000110)
static_assert(sizeof(UVoxelBlendMeshesToolBuilder) == 0x0030); // 48 bytes (0x000030 - 0x000030)
static_assert(sizeof(UVoxelMorphologyMeshesToolProperties) == 0x0080); // 128 bytes (0x000060 - 0x000080)
static_assert(sizeof(UVoxelMorphologyMeshesTool) == 0x0110); // 272 bytes (0x000108 - 0x000110)
static_assert(sizeof(UVoxelMorphologyMeshesToolBuilder) == 0x0030); // 48 bytes (0x000030 - 0x000030)
static_assert(sizeof(UVoxelSolidifyMeshesToolProperties) == 0x0080); // 128 bytes (0x000060 - 0x000080)
static_assert(sizeof(UVoxelSolidifyMeshesTool) == 0x0110); // 272 bytes (0x000108 - 0x000110)
static_assert(sizeof(UVoxelSolidifyMeshesToolBuilder) == 0x0030); // 48 bytes (0x000030 - 0x000030)
static_assert(sizeof(UWeldMeshEdgesToolBuilder) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UWeldMeshEdgesTool) == 0x0300); // 768 bytes (0x000088 - 0x000300)
static_assert(offsetof(UAddPatchTool, ShapeSettings) == 0x0090);
static_assert(offsetof(UAddPatchTool, MaterialProperties) == 0x0098);
static_assert(offsetof(UAddPatchTool, PreviewMesh) == 0x00A0);
static_assert(offsetof(UProceduralShapeToolProperties, PolygroupMode) == 0x0061);
static_assert(offsetof(UProceduralShapeToolProperties, PlaceMode) == 0x0062);
static_assert(offsetof(UProceduralShapeToolProperties, PivotLocation) == 0x0064);
static_assert(offsetof(ULastActorInfo, Actor) == 0x0038);
static_assert(offsetof(ULastActorInfo, StaticMesh) == 0x0040);
static_assert(offsetof(ULastActorInfo, ShapeSettings) == 0x0048);
static_assert(offsetof(ULastActorInfo, MaterialProperties) == 0x0050);
static_assert(offsetof(UAddPrimitiveTool, ShapeSettings) == 0x0090);
static_assert(offsetof(UAddPrimitiveTool, MaterialProperties) == 0x0098);
static_assert(offsetof(UAddPrimitiveTool, PreviewMesh) == 0x00A0);
static_assert(offsetof(UAddPrimitiveTool, LastGenerated) == 0x00A8);
static_assert(offsetof(UAddPrimitiveTool, AssetName) == 0x00B0);
static_assert(offsetof(UAlignObjectsToolProperties, AlignType) == 0x0060);
static_assert(offsetof(UAlignObjectsToolProperties, AlignTo) == 0x0064);
static_assert(offsetof(UAlignObjectsToolProperties, BoxPosition) == 0x0068);
static_assert(offsetof(UAlignObjectsTool, AlignProps) == 0x0098);
static_assert(offsetof(UBakeMeshAttributeMapsToolProperties, MapType) == 0x0060);
static_assert(offsetof(UBakeMeshAttributeMapsToolProperties, resolution) == 0x0064);
static_assert(offsetof(UBakeMeshAttributeMapsToolProperties, UVLayer) == 0x0070);
static_assert(offsetof(UBakeMeshAttributeMapsToolProperties, UVLayerNamesList) == 0x0080);
static_assert(offsetof(UBakeMeshAttributeMapsToolProperties, Result) == 0x0090);
static_assert(offsetof(UBakedOcclusionMapToolProperties, Preview) == 0x0060);
static_assert(offsetof(UBakedOcclusionMapToolProperties, Distribution) == 0x0070);
static_assert(offsetof(UBakedOcclusionMapToolProperties, NormalSpace) == 0x0080);
static_assert(offsetof(UBakedCurvatureMapToolProperties, CurvatureType) == 0x0060);
static_assert(offsetof(UBakedCurvatureMapToolProperties, ColorMode) == 0x0064);
static_assert(offsetof(UBakedCurvatureMapToolProperties, Clamping) == 0x0070);
static_assert(offsetof(UBakedTexture2DImageProperties, SourceTexture) == 0x0060);
static_assert(offsetof(UBakeMeshAttributeMapsTool, Settings) == 0x0090);
static_assert(offsetof(UBakeMeshAttributeMapsTool, NormalMapProps) == 0x0098);
static_assert(offsetof(UBakeMeshAttributeMapsTool, OcclusionMapProps) == 0x00A0);
static_assert(offsetof(UBakeMeshAttributeMapsTool, CurvatureMapProps) == 0x00A8);
static_assert(offsetof(UBakeMeshAttributeMapsTool, Texture2DProps) == 0x00B0);
static_assert(offsetof(UBakeMeshAttributeMapsTool, VisualizationProps) == 0x00B8);
static_assert(offsetof(UBakeMeshAttributeMapsTool, PreviewMaterial) == 0x00D0);
static_assert(offsetof(UBakeMeshAttributeMapsTool, BentNormalPreviewMaterial) == 0x00D8);
static_assert(offsetof(UBakeMeshAttributeMapsTool, CachedNormalMap) == 0x0440);
static_assert(offsetof(UBakeMeshAttributeMapsTool, CachedOcclusionMap) == 0x0470);
static_assert(offsetof(UBakeMeshAttributeMapsTool, CachedBentNormalMap) == 0x0478);
static_assert(offsetof(UBakeMeshAttributeMapsTool, CachedCurvatureMap) == 0x04A8);
static_assert(offsetof(UBakeMeshAttributeMapsTool, CachedMeshPropertyMap) == 0x04C0);
static_assert(offsetof(UBakeMeshAttributeMapsTool, CachedTexture2DImageMap) == 0x04D8);
static_assert(offsetof(UBakeMeshAttributeMapsTool, EmptyNormalMap) == 0x04E0);
static_assert(offsetof(UBakeMeshAttributeMapsTool, EmptyColorMapBlack) == 0x04E8);
static_assert(offsetof(UBakeMeshAttributeMapsTool, EmptyColorMapWhite) == 0x04F0);
static_assert(offsetof(UBakeTransformToolProperties, BakeScale) == 0x0061);
static_assert(offsetof(UBakeTransformTool, BasicProperties) == 0x0090);
static_assert(offsetof(FPhysicsSphereData, Transform) == 0x0010);
static_assert(offsetof(FPhysicsSphereData, Element) == 0x0040);
static_assert(offsetof(FPhysicsBoxData, Dimensions) == 0x0000);
static_assert(offsetof(FPhysicsBoxData, Transform) == 0x0010);
static_assert(offsetof(FPhysicsBoxData, Element) == 0x0040);
static_assert(offsetof(FPhysicsCapsuleData, Transform) == 0x0010);
static_assert(offsetof(FPhysicsCapsuleData, Element) == 0x0040);
static_assert(offsetof(FPhysicsConvexData, Element) == 0x0008);
static_assert(offsetof(UPhysicsObjectToolPropertySet, ObjectName) == 0x0060);
static_assert(offsetof(UPhysicsObjectToolPropertySet, CollisionType) == 0x0070);
static_assert(offsetof(UPhysicsObjectToolPropertySet, Spheres) == 0x0078);
static_assert(offsetof(UPhysicsObjectToolPropertySet, Boxes) == 0x0088);
static_assert(offsetof(UPhysicsObjectToolPropertySet, Capsules) == 0x0098);
static_assert(offsetof(UPhysicsObjectToolPropertySet, Convexes) == 0x00A8);
static_assert(offsetof(UCollisionGeometryVisualizationProperties, Color) == 0x0068);
static_assert(offsetof(UCombineMeshesToolProperties, WriteOutputTo) == 0x0064);
static_assert(offsetof(UCombineMeshesToolProperties, OutputName) == 0x0068);
static_assert(offsetof(UCombineMeshesToolProperties, OutputAsset) == 0x0078);
static_assert(offsetof(UCombineMeshesTool, BasicProperties) == 0x0090);
static_assert(offsetof(UCombineMeshesTool, HandleSourceProperties) == 0x0098);
static_assert(offsetof(UConvertToPolygonsToolProperties, ConversionMode) == 0x0060);
static_assert(offsetof(UConvertToPolygonsTool, Settings) == 0x0088);
static_assert(offsetof(UConvertToPolygonsTool, PreviewMesh) == 0x0090);
static_assert(offsetof(UCSGMeshesToolProperties, Operation) == 0x0060);
static_assert(offsetof(UCSGMeshesTool, CSGProperties) == 0x00F0);
static_assert(offsetof(UCSGMeshesTool, DrawnLineSet) == 0x0108);
static_assert(offsetof(UDeformMeshPolygonsTransformProperties, DeformationStrategy) == 0x0060);
static_assert(offsetof(UDeformMeshPolygonsTransformProperties, TransformMode) == 0x0061);
static_assert(offsetof(UDeformMeshPolygonsTransformProperties, SelectedWeightScheme) == 0x0068);
static_assert(offsetof(UDeformMeshPolygonsTool, DynamicMeshComponent) == 0x00C8);
static_assert(offsetof(UDeformMeshPolygonsTool, TransformProps) == 0x00D0);
static_assert(offsetof(UDisplaceMeshCommonProperties, DisplacementType) == 0x0060);
static_assert(offsetof(UDisplaceMeshCommonProperties, WeightMap) == 0x0070);
static_assert(offsetof(UDisplaceMeshCommonProperties, WeightMapsList) == 0x0078);
static_assert(offsetof(UDisplaceMeshTextureMapProperties, DisplacementMap) == 0x0060);
static_assert(offsetof(UDisplaceMeshDirectionalFilterProperties, FilterDirection) == 0x0064);
static_assert(offsetof(UDisplaceMeshPerlinNoiseProperties, PerlinLayerProperties) == 0x0060);
static_assert(offsetof(UDisplaceMeshSineWaveProperties, SineWaveDirection) == 0x0068);
static_assert(offsetof(UDisplaceMeshTool, CommonProperties) == 0x0088);
static_assert(offsetof(UDisplaceMeshTool, DirectionalFilterProperties) == 0x0090);
static_assert(offsetof(UDisplaceMeshTool, TextureMapProperties) == 0x0098);
static_assert(offsetof(UDisplaceMeshTool, NoiseProperties) == 0x00A0);
static_assert(offsetof(UDisplaceMeshTool, SineWaveProperties) == 0x00A8);
static_assert(offsetof(URevolveProperties, PolygroupMode) == 0x0077);
static_assert(offsetof(URevolveProperties, QuadSplitMode) == 0x0078);
static_assert(offsetof(URevolveProperties, CapFillMode) == 0x0088);
static_assert(offsetof(URevolveToolProperties, DrawPlaneOrigin) == 0x00B4);
static_assert(offsetof(URevolveToolProperties, DrawPlaneOrientation) == 0x00C0);
static_assert(offsetof(URevolveOperatorFactory, RevolveTool) == 0x0030);
static_assert(offsetof(UDrawAndRevolveTool, ControlPointsMechanic) == 0x00F8);
static_assert(offsetof(UDrawAndRevolveTool, PlaneMechanic) == 0x0100);
static_assert(offsetof(UDrawAndRevolveTool, Settings) == 0x0108);
static_assert(offsetof(UDrawAndRevolveTool, MaterialProperties) == 0x0110);
static_assert(offsetof(UDrawAndRevolveTool, Preview) == 0x0118);
static_assert(offsetof(UDrawPolygonToolStandardProperties, PolygonType) == 0x0060);
static_assert(offsetof(UDrawPolygonToolStandardProperties, OutputMode) == 0x0061);
static_assert(offsetof(UDrawPolygonTool, PolygonProperties) == 0x0088);
static_assert(offsetof(UDrawPolygonTool, SnapProperties) == 0x0090);
static_assert(offsetof(UDrawPolygonTool, MaterialProperties) == 0x0098);
static_assert(offsetof(UDrawPolygonTool, PreviewMesh) == 0x0150);
static_assert(offsetof(UDrawPolygonTool, PlaneTransformGizmo) == 0x0158);
static_assert(offsetof(UDrawPolygonTool, PlaneTransformProxy) == 0x0160);
static_assert(offsetof(UDrawPolygonTool, HeightMechanic) == 0x0540);
static_assert(offsetof(UDrawPolyPathProperties, OutputType) == 0x0060);
static_assert(offsetof(UDrawPolyPathProperties, WidthMode) == 0x0064);
static_assert(offsetof(UDrawPolyPathProperties, HeightMode) == 0x006C);
static_assert(offsetof(UDrawPolyPathExtrudeProperties, Direction) == 0x0060);
static_assert(offsetof(UDrawPolyPathTool, TransformProps) == 0x00A0);
static_assert(offsetof(UDrawPolyPathTool, ExtrudeProperties) == 0x00A8);
static_assert(offsetof(UDrawPolyPathTool, MaterialProperties) == 0x00B0);
static_assert(offsetof(UDrawPolyPathTool, PlaneMechanic) == 0x0140);
static_assert(offsetof(UDrawPolyPathTool, EditPreview) == 0x01E8);
static_assert(offsetof(UDrawPolyPathTool, ExtrudeHeightMechanic) == 0x01F0);
static_assert(offsetof(UDrawPolyPathTool, CurveDistMechanic) == 0x01F8);
static_assert(offsetof(UDrawPolyPathTool, SurfacePathMechanic) == 0x0200);
static_assert(offsetof(UDynamicMeshBrushTool, PreviewMesh) == 0x01C8);
static_assert(offsetof(UBrushSculptProperties, PrimaryBrushType) == 0x0061);
static_assert(offsetof(UMeshConstraintProperties, MeshBoundaryConstraint) == 0x0061);
static_assert(offsetof(UMeshConstraintProperties, GroupBoundaryConstraint) == 0x0062);
static_assert(offsetof(UMeshConstraintProperties, MaterialBoundaryConstraint) == 0x0063);
static_assert(offsetof(UFixedPlaneBrushProperties, position) == 0x0064);
static_assert(offsetof(UFixedPlaneBrushProperties, Rotation) == 0x0070);
static_assert(offsetof(UDynamicMeshSculptTool, BrushProperties) == 0x00C0);
static_assert(offsetof(UDynamicMeshSculptTool, SculptProperties) == 0x00C8);
static_assert(offsetof(UDynamicMeshSculptTool, SculptMaxBrushProperties) == 0x00D0);
static_assert(offsetof(UDynamicMeshSculptTool, KelvinBrushProperties) == 0x00D8);
static_assert(offsetof(UDynamicMeshSculptTool, RemeshProperties) == 0x00E0);
static_assert(offsetof(UDynamicMeshSculptTool, GizmoProperties) == 0x00E8);
static_assert(offsetof(UDynamicMeshSculptTool, ViewProperties) == 0x00F0);
static_assert(offsetof(UDynamicMeshSculptTool, SculptToolActions) == 0x00F8);
static_assert(offsetof(UDynamicMeshSculptTool, BrushIndicator) == 0x0140);
static_assert(offsetof(UDynamicMeshSculptTool, BrushIndicatorMaterial) == 0x0148);
static_assert(offsetof(UDynamicMeshSculptTool, BrushIndicatorMesh) == 0x0150);
static_assert(offsetof(UDynamicMeshSculptTool, DynamicMeshComponent) == 0x0158);
static_assert(offsetof(UDynamicMeshSculptTool, ActiveOverrideMaterial) == 0x0160);
static_assert(offsetof(UDynamicMeshSculptTool, PlaneTransformGizmo) == 0x0D08);
static_assert(offsetof(UDynamicMeshSculptTool, PlaneTransformProxy) == 0x0D10);
static_assert(offsetof(UEdgeLoopInsertionProperties, PositionMode) == 0x0060);
static_assert(offsetof(UEdgeLoopInsertionProperties, InsertionMode) == 0x0064);
static_assert(offsetof(UEdgeLoopInsertionOperatorFactory, Tool) == 0x0030);
static_assert(offsetof(UEdgeLoopInsertionTool, Settings) == 0x0098);
static_assert(offsetof(UEdgeLoopInsertionTool, Preview) == 0x0300);
static_assert(offsetof(UPolyEditCommonProperties, LocalFrameMode) == 0x0064);
static_assert(offsetof(UPolyEditExtrudeProperties, Direction) == 0x0060);
static_assert(offsetof(UPolyEditCutProperties, Orientation) == 0x0060);
static_assert(offsetof(UEditMeshPolygonsTool, DynamicMeshComponent) == 0x00D0);
static_assert(offsetof(UEditMeshPolygonsTool, CommonProps) == 0x00D8);
static_assert(offsetof(UEditMeshPolygonsTool, EditActions) == 0x00E0);
static_assert(offsetof(UEditMeshPolygonsTool, EditActions_Triangles) == 0x00E8);
static_assert(offsetof(UEditMeshPolygonsTool, EditEdgeActions) == 0x00F0);
static_assert(offsetof(UEditMeshPolygonsTool, EditEdgeActions_Triangles) == 0x00F8);
static_assert(offsetof(UEditMeshPolygonsTool, EditUVActions) == 0x0100);
static_assert(offsetof(UEditMeshPolygonsTool, ExtrudeProperties) == 0x0108);
static_assert(offsetof(UEditMeshPolygonsTool, OffsetProperties) == 0x0110);
static_assert(offsetof(UEditMeshPolygonsTool, InsetProperties) == 0x0118);
static_assert(offsetof(UEditMeshPolygonsTool, OutsetProperties) == 0x0120);
static_assert(offsetof(UEditMeshPolygonsTool, CutProperties) == 0x0128);
static_assert(offsetof(UEditMeshPolygonsTool, SetUVProperties) == 0x0130);
static_assert(offsetof(UEditMeshPolygonsTool, SelectionMechanic) == 0x0138);
static_assert(offsetof(UEditMeshPolygonsTool, MultiTransformer) == 0x0148);
static_assert(offsetof(UEditMeshPolygonsTool, EditPreview) == 0x04A0);
static_assert(offsetof(UEditMeshPolygonsTool, ExtrudeHeightMechanic) == 0x04B0);
static_assert(offsetof(UEditMeshPolygonsTool, CurveDistMechanic) == 0x04B8);
static_assert(offsetof(UEditMeshPolygonsTool, SurfacePathMechanic) == 0x04C0);
static_assert(offsetof(UEditNormalsToolProperties, NormalCalculationMethod) == 0x0061);
static_assert(offsetof(UEditNormalsToolProperties, SplitNormalMethod) == 0x0064);
static_assert(offsetof(UEditNormalsOperatorFactory, Tool) == 0x0030);
static_assert(offsetof(UEditNormalsTool, BasicProperties) == 0x0090);
static_assert(offsetof(UEditNormalsTool, AdvancedProperties) == 0x0098);
static_assert(offsetof(UEditNormalsTool, Previews) == 0x00A0);
static_assert(offsetof(UEditPivotToolProperties, RotationMode) == 0x0061);
static_assert(offsetof(FEditPivotTarget, TransformProxy) == 0x0000);
static_assert(offsetof(FEditPivotTarget, TransformGizmo) == 0x0008);
static_assert(offsetof(UEditPivotTool, TransformProps) == 0x0098);
static_assert(offsetof(UEditPivotTool, EditPivotActions) == 0x00A0);
static_assert(offsetof(UEditPivotTool, ActiveGizmos) == 0x0178);
static_assert(offsetof(UEditUVIslandsTool, MaterialSettings) == 0x00C8);
static_assert(offsetof(UEditUVIslandsTool, CheckerMaterial) == 0x00D0);
static_assert(offsetof(UEditUVIslandsTool, DynamicMeshComponent) == 0x00D8);
static_assert(offsetof(UEditUVIslandsTool, SelectionMechanic) == 0x00E0);
static_assert(offsetof(UEditUVIslandsTool, MultiTransformer) == 0x00F0);
static_assert(offsetof(UExtractCollisionGeometryTool, VizSettings) == 0x0088);
static_assert(offsetof(UExtractCollisionGeometryTool, ObjectProps) == 0x0090);
static_assert(offsetof(UExtractCollisionGeometryTool, PreviewElements) == 0x0098);
static_assert(offsetof(UExtractCollisionGeometryTool, PreviewMesh) == 0x00A0);
static_assert(offsetof(UGroupEdgeInsertionProperties, InsertionMode) == 0x0060);
static_assert(offsetof(UGroupEdgeInsertionOperatorFactory, Tool) == 0x0030);
static_assert(offsetof(UGroupEdgeInsertionTool, Settings) == 0x0098);
static_assert(offsetof(UGroupEdgeInsertionTool, Preview) == 0x00A0);
static_assert(offsetof(UHoleFillToolProperties, FillType) == 0x0060);
static_assert(offsetof(UHoleFillStatisticsProperties, InitialHoles) == 0x0060);
static_assert(offsetof(UHoleFillStatisticsProperties, SelectedHoles) == 0x0070);
static_assert(offsetof(UHoleFillStatisticsProperties, SuccessfulFills) == 0x0080);
static_assert(offsetof(UHoleFillStatisticsProperties, FailedFills) == 0x0090);
static_assert(offsetof(UHoleFillStatisticsProperties, RemainingHoles) == 0x00A0);
static_assert(offsetof(UHoleFillOperatorFactory, FillTool) == 0x0030);
static_assert(offsetof(UHoleFillTool, SmoothHoleFillProperties) == 0x0098);
static_assert(offsetof(UHoleFillTool, Properties) == 0x00A0);
static_assert(offsetof(UHoleFillTool, Actions) == 0x00A8);
static_assert(offsetof(UHoleFillTool, Statistics) == 0x00B0);
static_assert(offsetof(UHoleFillTool, Preview) == 0x00B8);
static_assert(offsetof(UHoleFillTool, SelectionMechanic) == 0x00C0);
static_assert(offsetof(UMeshAnalysisProperties, SurfaceArea) == 0x0060);
static_assert(offsetof(UMeshAnalysisProperties, Volume) == 0x0070);
static_assert(offsetof(UMeshAttributePaintToolProperties, Attributes) == 0x0060);
static_assert(offsetof(UMeshAttributePaintToolProperties, AttributeName) == 0x0078);
static_assert(offsetof(UMeshAttributePaintTool, AttribProps) == 0x0208);
static_assert(offsetof(UMeshBoundaryToolBase, SelectionMechanic) == 0x0138);
static_assert(offsetof(UMeshBoundaryToolBase, LoopSelectClickBehavior) == 0x0140);
static_assert(offsetof(UMeshInspectorTool, Settings) == 0x0088);
static_assert(offsetof(UMeshInspectorTool, MaterialSettings) == 0x0090);
static_assert(offsetof(UMeshInspectorTool, PreviewMesh) == 0x00A0);
static_assert(offsetof(UMeshInspectorTool, DrawnLineSet) == 0x00A8);
static_assert(offsetof(UMeshInspectorTool, DefaultMaterial) == 0x00B0);
static_assert(offsetof(UNewMeshMaterialProperties, Material) == 0x0060);
static_assert(offsetof(UExistingMeshMaterialProperties, MaterialMode) == 0x0060);
static_assert(offsetof(UExistingMeshMaterialProperties, OverrideMaterial) == 0x0068);
static_assert(offsetof(UExistingMeshMaterialProperties, CheckerMaterial) == 0x0070);
static_assert(offsetof(UMeshEditingViewProperties, MaterialMode) == 0x0064);
static_assert(offsetof(UMeshEditingViewProperties, Color) == 0x006C);
static_assert(offsetof(UMeshEditingViewProperties, Image) == 0x0080);
static_assert(offsetof(UPlaneBrushOpProps, WhichSide) == 0x006C);
static_assert(offsetof(UViewAlignedPlaneBrushOpProps, WhichSide) == 0x006C);
static_assert(offsetof(UFixedPlaneBrushOpProps, WhichSide) == 0x006C);
static_assert(offsetof(UWorkPlaneProperties, position) == 0x0064);
static_assert(offsetof(UWorkPlaneProperties, Rotation) == 0x0070);
static_assert(offsetof(UMeshSculptToolBase, BrushProperties) == 0x00C0);
static_assert(offsetof(UMeshSculptToolBase, GizmoProperties) == 0x00C8);
static_assert(offsetof(UMeshSculptToolBase, BrushOpPropSets) == 0x01B0);
static_assert(offsetof(UMeshSculptToolBase, SecondaryBrushOpPropSets) == 0x0250);
static_assert(offsetof(UMeshSculptToolBase, ViewProperties) == 0x0870);
static_assert(offsetof(UMeshSculptToolBase, ActiveOverrideMaterial) == 0x0878);
static_assert(offsetof(UMeshSculptToolBase, BrushIndicator) == 0x0880);
static_assert(offsetof(UMeshSculptToolBase, BrushIndicatorMaterial) == 0x0888);
static_assert(offsetof(UMeshSculptToolBase, BrushIndicatorMesh) == 0x0890);
static_assert(offsetof(UMeshSculptToolBase, PlaneTransformGizmo) == 0x0898);
static_assert(offsetof(UMeshSculptToolBase, PlaneTransformProxy) == 0x08A0);
static_assert(offsetof(UMeshSelectionToolProperties, SelectionMode) == 0x0060);
static_assert(offsetof(UMeshSelectionToolProperties, FaceColorMode) == 0x006C);
static_assert(offsetof(UMeshSelectionTool, SelectionProps) == 0x0208);
static_assert(offsetof(UMeshSelectionTool, SelectionActions) == 0x0210);
static_assert(offsetof(UMeshSelectionTool, EditActions) == 0x0218);
static_assert(offsetof(UMeshSelectionTool, Selection) == 0x0220);
static_assert(offsetof(UMeshSelectionTool, SpawnedActors) == 0x0228);
static_assert(offsetof(UFlattenBrushOpProps, WhichSide) == 0x006C);
static_assert(offsetof(USpaceDeformerOperatorFactory, SpaceDeformerTool) == 0x0030);
static_assert(offsetof(UMeshSpaceDeformerTool, SelectedOperationType) == 0x00C0);
static_assert(offsetof(UMeshSpaceDeformerTool, StateTarget) == 0x00D8);
static_assert(offsetof(UMeshSpaceDeformerTool, Preview) == 0x00E8);
static_assert(offsetof(UMeshSpaceDeformerTool, GizmoCenter) == 0x0110);
static_assert(offsetof(UMeshSpaceDeformerTool, GizmoOrientation) == 0x0120);
static_assert(offsetof(UMeshSpaceDeformerTool, IntervalGizmo) == 0x0130);
static_assert(offsetof(UMeshSpaceDeformerTool, TransformGizmo) == 0x0138);
static_assert(offsetof(UMeshSpaceDeformerTool, TransformProxy) == 0x0140);
static_assert(offsetof(UMeshSpaceDeformerTool, UpIntervalSource) == 0x0148);
static_assert(offsetof(UMeshSpaceDeformerTool, DownIntervalSource) == 0x0150);
static_assert(offsetof(UMeshSpaceDeformerTool, ForwardIntervalSource) == 0x0158);
static_assert(offsetof(UMeshStatisticsProperties, Mesh) == 0x0060);
static_assert(offsetof(UMeshStatisticsProperties, UV) == 0x0070);
static_assert(offsetof(UMeshStatisticsProperties, Attributes) == 0x0080);
static_assert(offsetof(UVertexBrushSculptProperties, PrimaryBrushType) == 0x0060);
static_assert(offsetof(UVertexBrushSculptProperties, PrimaryFalloffType) == 0x0061);
static_assert(offsetof(UMeshVertexSculptTool, SculptProperties) == 0x09D8);
static_assert(offsetof(UMeshVertexSculptTool, DynamicMeshComponent) == 0x09E0);
static_assert(offsetof(UMirrorToolProperties, OperationMode) == 0x0060);
static_assert(offsetof(UMirrorToolProperties, CtrlClickBehavior) == 0x0065);
static_assert(offsetof(UMirrorToolProperties, SaveMode) == 0x0068);
static_assert(offsetof(UMirrorOperatorFactory, MirrorTool) == 0x0030);
static_assert(offsetof(UMirrorTool, Settings) == 0x0098);
static_assert(offsetof(UMirrorTool, ToolActions) == 0x00A0);
static_assert(offsetof(UMirrorTool, MeshesToMirror) == 0x00A8);
static_assert(offsetof(UMirrorTool, Previews) == 0x00B8);
static_assert(offsetof(UMirrorTool, PlaneMechanic) == 0x0110);
static_assert(offsetof(UOffsetMeshToolProperties, OffsetType) == 0x0060);
static_assert(offsetof(UOffsetMeshTool, OffsetProperties) == 0x0400);
static_assert(offsetof(UOffsetMeshTool, IterativeProperties) == 0x0408);
static_assert(offsetof(UOffsetMeshTool, ImplicitProperties) == 0x0410);
static_assert(offsetof(UOffsetMeshTool, WeightMapProperties) == 0x0418);
static_assert(offsetof(UPhysicsInspectorTool, VizSettings) == 0x0090);
static_assert(offsetof(UPhysicsInspectorTool, ObjectData) == 0x0098);
static_assert(offsetof(UPhysicsInspectorTool, LineMaterial) == 0x00A8);
static_assert(offsetof(UPhysicsInspectorTool, PreviewElements) == 0x00B0);
static_assert(offsetof(UPlaneCutOperatorFactory, CutTool) == 0x0030);
static_assert(offsetof(UPlaneCutTool, BasicProperties) == 0x0098);
static_assert(offsetof(UPlaneCutTool, AcceptProperties) == 0x00A0);
static_assert(offsetof(UPlaneCutTool, CutPlaneOrigin) == 0x00A8);
static_assert(offsetof(UPlaneCutTool, CutPlaneOrientation) == 0x00C0);
static_assert(offsetof(UPlaneCutTool, Previews) == 0x00D0);
static_assert(offsetof(UPlaneCutTool, MeshesToCut) == 0x00E0);
static_assert(offsetof(UPlaneCutTool, PlaneTransformGizmo) == 0x0148);
static_assert(offsetof(UPlaneCutTool, PlaneTransformProxy) == 0x0150);
static_assert(offsetof(UPositionPlaneGizmo, CenterBallShape) == 0x0088);
static_assert(offsetof(UPositionPlaneGizmo, CenterBallMaterial) == 0x0090);
static_assert(offsetof(URemeshMeshToolProperties, SmoothingType) == 0x0074);
static_assert(offsetof(URemeshMeshToolProperties, RemeshType) == 0x0078);
static_assert(offsetof(URemeshMeshTool, BasicProperties) == 0x0098);
static_assert(offsetof(URemeshMeshTool, MeshStatisticsProperties) == 0x00A0);
static_assert(offsetof(URemeshMeshTool, Preview) == 0x00A8);
static_assert(offsetof(URemoveOccludedTrianglesToolProperties, OcclusionTestMethod) == 0x0060);
static_assert(offsetof(URemoveOccludedTrianglesToolProperties, TriangleSampling) == 0x0061);
static_assert(offsetof(URemoveOccludedTrianglesOperatorFactory, Tool) == 0x0030);
static_assert(offsetof(URemoveOccludedTrianglesTool, BasicProperties) == 0x0090);
static_assert(offsetof(URemoveOccludedTrianglesTool, AdvancedProperties) == 0x0098);
static_assert(offsetof(URemoveOccludedTrianglesTool, Previews) == 0x00A0);
static_assert(offsetof(URemoveOccludedTrianglesTool, PreviewCopies) == 0x00B0);
static_assert(offsetof(URevolveBoundaryOperatorFactory, RevolveBoundaryTool) == 0x0030);
static_assert(offsetof(URevolveBoundaryToolProperties, AxisOrigin) == 0x00B4);
static_assert(offsetof(URevolveBoundaryTool, Settings) == 0x0160);
static_assert(offsetof(URevolveBoundaryTool, MaterialProperties) == 0x0168);
static_assert(offsetof(URevolveBoundaryTool, PlaneMechanic) == 0x0170);
static_assert(offsetof(URevolveBoundaryTool, Preview) == 0x0178);
static_assert(offsetof(USeamSculptTool, Settings) == 0x0208);
static_assert(offsetof(USeamSculptTool, PreviewGeom) == 0x0210);
static_assert(offsetof(USelfUnionMeshesTool, Properties) == 0x00F0);
static_assert(offsetof(USelfUnionMeshesTool, DrawnLineSet) == 0x00F8);
static_assert(offsetof(USetCollisionGeometryToolProperties, GeometryType) == 0x0060);
static_assert(offsetof(USetCollisionGeometryToolProperties, InputMode) == 0x0064);
static_assert(offsetof(USetCollisionGeometryToolProperties, SweepAxis) == 0x0084);
static_assert(offsetof(USetCollisionGeometryToolProperties, SetCollisionType) == 0x008C);
static_assert(offsetof(USetCollisionGeometryTool, Settings) == 0x0090);
static_assert(offsetof(USetCollisionGeometryTool, VizSettings) == 0x0098);
static_assert(offsetof(USetCollisionGeometryTool, CollisionProps) == 0x00A0);
static_assert(offsetof(USetCollisionGeometryTool, LineMaterial) == 0x00A8);
static_assert(offsetof(USetCollisionGeometryTool, PreviewGeom) == 0x00B0);
static_assert(offsetof(USmoothMeshToolProperties, SmoothingType) == 0x0060);
static_assert(offsetof(USmoothMeshTool, SmoothProperties) == 0x0400);
static_assert(offsetof(USmoothMeshTool, IterativeProperties) == 0x0408);
static_assert(offsetof(USmoothMeshTool, DiffusionProperties) == 0x0410);
static_assert(offsetof(USmoothMeshTool, ImplicitProperties) == 0x0418);
static_assert(offsetof(USmoothMeshTool, WeightMapProperties) == 0x0420);
static_assert(offsetof(UTransformMeshesToolProperties, TransformMode) == 0x0060);
static_assert(offsetof(UTransformMeshesToolProperties, SnapDragSource) == 0x0063);
static_assert(offsetof(UTransformMeshesToolProperties, RotationMode) == 0x0064);
static_assert(offsetof(FTransformMeshesTarget, TransformProxy) == 0x0000);
static_assert(offsetof(FTransformMeshesTarget, TransformGizmo) == 0x0008);
static_assert(offsetof(UTransformMeshesTool, TransformProps) == 0x0098);
static_assert(offsetof(UTransformMeshesTool, ActiveGizmos) == 0x00B0);
static_assert(offsetof(UUVProjectionToolProperties, UVProjectionMethod) == 0x0060);
static_assert(offsetof(UUVProjectionToolProperties, ProjectionPrimitiveScale) == 0x0064);
static_assert(offsetof(UUVProjectionToolProperties, UVScale) == 0x0074);
static_assert(offsetof(UUVProjectionToolProperties, UVOffset) == 0x007C);
static_assert(offsetof(UUVProjectionOperatorFactory, Tool) == 0x0030);
static_assert(offsetof(UUVProjectionTool, BasicProperties) == 0x0090);
static_assert(offsetof(UUVProjectionTool, AdvancedProperties) == 0x0098);
static_assert(offsetof(UUVProjectionTool, MaterialSettings) == 0x00A0);
static_assert(offsetof(UUVProjectionTool, Previews) == 0x00A8);
static_assert(offsetof(UUVProjectionTool, CheckerMaterial) == 0x00B8);
static_assert(offsetof(UUVProjectionTool, TransformGizmos) == 0x00C0);
static_assert(offsetof(UUVProjectionTool, TransformProxies) == 0x00D0);
static_assert(offsetof(UVoxelBlendMeshesTool, BlendProperties) == 0x0108);
static_assert(offsetof(UVoxelMorphologyMeshesToolProperties, Operation) == 0x0060);
static_assert(offsetof(UVoxelMorphologyMeshesTool, MorphologyProperties) == 0x0108);
static_assert(offsetof(UVoxelSolidifyMeshesTool, SolidifyProperties) == 0x0108);
