
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: MovieScene
/// dependency: MovieSceneTracks

#pragma pack(push, 0x1)

/// Enum /Script/SequencerScripting.ESequenceTimeUnit
/// Size: 0x01 (1 bytes)
enum class ESequenceTimeUnit : uint8_t
{
	ESequenceTimeUnit__DisplayRate                                                   = 0,
	ESequenceTimeUnit__TickResolution                                                = 1
};

#pragma pack(pop)


static_assert(sizeof(UMovieSceneBindingExtensions) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UMovieSceneEventTrackExtensions) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UMovieSceneFolderExtensions) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UMovieScenePropertyTrackExtensions) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UMovieSceneScriptingKey) == 0x0040); // 64 bytes (0x000028 - 0x000040)
static_assert(sizeof(UMovieSceneScriptingActorReferenceKey) == 0x0060); // 96 bytes (0x000040 - 0x000060)
static_assert(sizeof(UMovieSceneScriptingChannel) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(UMovieSceneScriptingActorReferenceChannel) == 0x0060); // 96 bytes (0x000030 - 0x000060)
static_assert(sizeof(UMovieSceneScriptingBoolKey) == 0x0060); // 96 bytes (0x000040 - 0x000060)
static_assert(sizeof(UMovieSceneScriptingBoolChannel) == 0x0060); // 96 bytes (0x000030 - 0x000060)
static_assert(sizeof(UMovieSceneScriptingByteKey) == 0x0060); // 96 bytes (0x000040 - 0x000060)
static_assert(sizeof(UMovieSceneScriptingByteChannel) == 0x0060); // 96 bytes (0x000030 - 0x000060)
static_assert(sizeof(UMovieSceneScriptingEventKey) == 0x0060); // 96 bytes (0x000040 - 0x000060)
static_assert(sizeof(UMovieSceneScriptingEventChannel) == 0x0060); // 96 bytes (0x000030 - 0x000060)
static_assert(sizeof(UMovieSceneScriptingFloatKey) == 0x0060); // 96 bytes (0x000040 - 0x000060)
static_assert(sizeof(UMovieSceneScriptingFloatChannel) == 0x0060); // 96 bytes (0x000030 - 0x000060)
static_assert(sizeof(UMovieSceneScriptingIntegerKey) == 0x0060); // 96 bytes (0x000040 - 0x000060)
static_assert(sizeof(UMovieSceneScriptingIntegerChannel) == 0x0060); // 96 bytes (0x000030 - 0x000060)
static_assert(sizeof(UMovieSceneScriptingObjectPathKey) == 0x0060); // 96 bytes (0x000040 - 0x000060)
static_assert(sizeof(UMovieSceneScriptingObjectPathChannel) == 0x0060); // 96 bytes (0x000030 - 0x000060)
static_assert(sizeof(UMovieSceneScriptingStringKey) == 0x0060); // 96 bytes (0x000040 - 0x000060)
static_assert(sizeof(UMovieSceneScriptingStringChannel) == 0x0060); // 96 bytes (0x000030 - 0x000060)
static_assert(sizeof(UMovieSceneSectionExtensions) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UMovieSceneSequenceExtensions) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UMovieSceneTrackExtensions) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UMovieSceneVectorTrackExtensions) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(USequencerScriptingRangeExtensions) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(FSequencerBindingProxy) == 0x0018); // 24 bytes (0x000000 - 0x000018)
static_assert(sizeof(FSequencerScriptingRange) == 0x0014); // 20 bytes (0x000000 - 0x000014)
static_assert(offsetof(UMovieSceneScriptingChannel, ChannelName) == 0x0028);
static_assert(offsetof(FSequencerBindingProxy, BindingID) == 0x0000);
static_assert(offsetof(FSequencerBindingProxy, Sequence) == 0x0010);
static_assert(offsetof(FSequencerScriptingRange, InternalRate) == 0x000C);
